[{"website": "http://www.medg.csail.mit.edu/people/psz/psz.html", "bio": "\n <p>Peter Szolovits is Professor of Computer Science and Engineering and head of the Clinical Decision-Making Group within CSAIL. His research centers on the application of AI methods to problems of medical decision making and design of information systems for health care institutions and patients. He has worked on problems of diagnosis, therapy planning, execution and monitoring for various medical conditions, computational aspects of genetic counseling, controlled sharing of health information, and privacy and confidentiality issues in medical record systems.</p> \r\n\r\n <p>Peter Szolovits' interests in AI include knowledge representation, qualitative reasoning, and probabilistic inference. His interests in medical computing include Web-based heterogeneous medical record systems, life-long personal health information systems, and design of cryptographic schemes for health identifiers. He teaches classes in artificial intelligence, programming languages, medical computing, medical desision making, knowledge-based systems and probabilistic inference.</p> \r\n\r\n <p>Prof. Szolovits is on the editorial board of several journals, has served as program chairman and on the program committees of national conferences, and has been a founder of and consultant for several companies that apply AI to problems of commercial interest. Prof. Szolovits was elected to the Institute of Medicine of the National Academies and is a Fellow of the American Association for Artificial Intelligence, the American College of Medical Informatics and the American Institute for Medical and Biological Engineering.</p> \n        ", "name": "Peter Szolovits", "title": "Professor", "phone": "+1 (617) 253-3476", "publications": ["P. Szolovits, Ed. Artificial Intelligence in Medicine. AAAS Selected Symposium Series. Boulder, Colorado, Westview Press. 1982.", "P. Szolovits, J. Doyle, W. J. Long, I. Kohane and S. G. Pauker. Guardian Angel: Patient-Centered Health Information Systems. Technical Report TR-604. MIT Lab for Computer Science. May 1994.", "I. S. Kohane, P. Greenspun, J. Fackler, C. Cimino and P. Szolovits. W3-EMRS: Access to Multi- Institutional Electronic Medical Records via World Wide Web. Spring Congress of the American Medical Informatics Association, Boston, MA. 1995.", "Mandl, K. D., P. Szolovits, I. S. Kohane. Public standards and patients' control: how to keep electronic medical records accessible but private. British Medical Journal 322(7281): 283-287, 2000.", "A. Riva, et al. The Personal Internetworked Notary and Guardian. Int. J. Medical Informatics 62:27-40, 2001.", "Fraser, H. S., P. Biondich, et al. (2005). \"Implementing electronic medical record systems in developing countries.\" Inform Prim Care 13(2): 83-95.", "Sebastiani, P., K. D. Mandl, et al. (2006). \"A Bayesian dynamic model for influenza surveillance.\" Stat Med 25(11): 1803-16; discussion 1817-25.", "Mohtashemi, M., P. Szolovits, et al. (2006). \"A susceptible-infected model of early detection of respiratory infection outbreaks on a background of influenza.\" J Theor Biol 241: 954-963. "], "study_areas": ["Classic AI-Bio"], "email": "psz@mit.edu", "profile_link": "http://www.csail.mit.edu/user/1513"},
{"website": "http://www.swiss.csail.mit.edu/~gjs/gjs.html", "bio": "\n <p>Gerald Jay Sussman is the Matsushita Professor of Electrical Engineering at the Massachusetts Institute of Technology. He received the S.B. and the Ph.D. degrees in mathematics from the Massachusetts Institute of Technology in 1968 and 1973, respectively. He has been involved in artificial intelligence research at M.I.T. since 1964. His research has centered on understanding the problem-solving strategies used by scientists and engineers, with the goals of automating parts of the process and formalizing it to provide more effective methods of science and engineering education. Sussman has also worked in computer languages, in computer architecture and in VLSI design.</p> \r\n\r\n <p>Sussman is a coauthor (with Hal Abelson and Julie Sussman) of the introductory computer science textbook used at M.I.T. The textbook, \"Structure and Interpretation of Computer Programs,\" has been translated into French, German, Chinese, Polish, and Japanese. As a result of this and other contributions to computer-science education, Sussman received the ACM's Karl Karlstrom Outstanding Educator Award in 1990, and the Amar G. Bose award for teaching in 1991.</p> \r\n\r\n <p>Sussman's contributions to Artificial Intelligence include problem solving by debugging almost-right plans, propagation of constraints applied to electrical circuit analysis and synthesis, dependency-based explanation and dependency-based backtracking, and various language structures for expressing problem-solving strategies. Sussman and his former student, Guy L. Steele Jr., invented the Scheme programming language in 1975.</p> \r\n\r\n <p>Sussman saw that Artificial Intelligence ideas can be applied to computer-aided design. Sussman developed, with his graduate students, sophisticated computer-aided design tools for VLSI. Steele made the first Scheme chips in 1978. These ideas and the AI-based CAD technology to support them were further developed in the Scheme chips of 1979 and 1981. The technique and experience developed was then used to design other special-purpose computers. Sussman was the principal designer of the Digital Orrery, a machine designed to do high-precision integrations for orbital-mechanics experiments. The Orrery was designed and built by a few people in a few months, using AI-based simulation and compilation tools.</p> \r\n\r\n <p>Using the Digital Orrery, Sussman has worked with Jack Wisdom to discover numerical evidence for chaotic motions in the outer planets. The Digital Orrery is now retired at the Smithsonian Institution in Washington DC. Sussman was also the lead designer of the Supercomputer Toolkit, another multiprocessor computer optimized for evolving systems of ordinary differential equations. The Supercomputer Toolkit was used by Sussman and Wisdom to confirm and extend the discoveries made with the Digital Orrery to include the entire planetary system.</p> \r\n\r\n <p>Sussman has pioneered the use of computational descriptions to communicate methodological ideas in teaching subjects in Electrical Circuits and in Signals and Systems. Over the past decade Sussman and Wisdom have developed a subject that uses computational techniques to communicate a deeper understanding of advanced Classical Mechanics. Computational algorithms are used to express the methods used in the analysis of dynamical phenomena. Expressing the methods in a computer language forces them to be unambiguous and computationally effective. Students are expected to read our programs and to extend them and to write new ones. The task of formulating a method as a computer-executable program and debugging that program is a powerful exercise in the learning process. Also, once formalized procedurally, a mathematical idea becomes a tool that can be used directly to compute results. Sussman and Wisdom, with Meinhard Mayer, have produced a new textbook, \"Structure and Interpretation of Classical Mechanics,\" to capture these new ideas.</p> \r\n\r\n <p>Sussman is a fellow of the Institute of Electrical and Electronics Engineers (IEEE). He is a member of the National Academy of Engineering (NAE), a fellow of the American Association for Artificial Intelligence (AAAI), a fellow of the Association for Computing Machinery (ACM), and a fellow of the American Academy of Arts and Sciences. He is also a bonded locksmith, a life member of the American Watchmakers-Clockmakers Institute (AWI), a member of the Massachusetts Watchmakers-Clockmakers Association, a member of the Amateur Telescope Makers of Boston (ATMOB), and a member of the American Radio Relay League (ARRL). </p> \n        ", "name": "Gerald Sussman", "title": "Professor", "phone": "+1 (617) 253-5874", "publications": ["Structure and Interpretation of Classical Mechanics, Gerald Jay Sussman and Jack Wisdom with Meinhard E. Mayer, MIT Press, 2001.", "``Cellular Gate Technology,'' Thomas F. Knight and Gerald Jay Sussman, Proc. UMC98, First International Conference on Unconventional Models of Computation, Auckland, NZ, January 1998.", "``Sparse Representations for Fast, One-shot learning'', Kenneth Yip and Gerald Jay Sussman, Proc. of National Conference on Artificial Intelligence, July 1997.\r\n\r\nA longer version appears as MIT AI Lab Memo #1633, May 1998", "``A Computational Model for the Acquisition and Use of Phonological Knowledge,'' Kenneth Yip and Gerald Jay Sussman, MIT Artificial Intelligence Memo 1575, March 1996.", "``Amorphous Computing,'' Harold Abelson, Don Allen, Daniel Coore, Chris Hanson, George Homsy, Thomas F. Knight, Jr., Radhika Nagpal, Erik Rauch, Gerald Jay Sussman, Ron Weiss, in Communications of the ACM , 43 , 5, May 2000. Also as MIT Artificial Intelligence Memo 1665, August 1999.", "``Comparison between subsonic flow simulation and physical measurements of flue pipes,'' Panayotis. A. Skordos and Gerald Jay Sussman, Proceedings of ISMA 95, International Symposium on Musical Acoustics, Le Normont, France, July 1995. Also MIT Artificial Intelligence Memo 1535, April 1995.", "``Gravitational radiation from a particle in circular orbit around a black hole. II: Numerical results for the nonrotating case,'' Curt Cutler, Lee Samuel Finn, Eric Poisson, and Gerald Jay Sussman, Phys. Rev. D., 47, No. 4, pp 1511--1517, Feb 1993.", "``The last three minutes: measurements of coalescing compact binaries with LIGO,'' C. Cutler, T.A. Apostolatos, L. Bildsten, L.S. Finn, E.E.Flanagan, D. Kennefick, D.M. Markovic, A. Ori, E. Poisson, G.J. Sussman, and K.S. Thorne, Phys. Rev. Letters, 70, pp. 2984--2988.", "``Chaotic Evolution of the Solar System,'' Gerald Jay Sussman and Jack Wisdom, Science, 257, 3 July 1992.", "``The Supercomputer Toolkit: A general framework for special-purpose computing,'' with A. Berlin, J. Katzenelson, W. McAllister, G. Rozas, G. J. Sussman, and Jack Wisdom, International Journal of High-Speed Electronics, 3, no. 3, pp. 337--361, 1992.", "``Intelligence in Scientific Computing,'' Hal Abelson, M. Eisenberg, M. Halfant, J. Katzenelson, E. Sacks, G.J. Sussman, J. Wisdom, K. Yip, CACM, 32, no. 5, May 1989.", "``The Dynamicist's Workbench I: Automatic preparation of numerical experiments,'' Hal Abelson and Gerald Jay Sussman, in Symbolic Computation: Applications to Scientific Computing, R. Grossman (ed.), Frontiers in Applied Mathematics, vol. 5, Society for Industrial and Applied Mathematics, Philadephia, 1989.", "``Lisp: a Language for Stratified Design,'' Hal Abelson and Gerald Jay Sussman, Byte Magazine, February 1988, pp. 207--218.", "``The Lisp Experience,'' Hal Abelson, Matthew Halfant, Jacob Katzenelson and Gerald Jay Sussman, Annual Review of Computer Science, 3, 1988, pp. 167--195.", "``Abstraction in Numerical Methods,'' Matthew Halfant and Gerald Jay Sussman, Proc. ACM Conference on Lisp and Functional Programming, 1988.", "``Advanced Computing for Science,'' Piet Hut and Gerald Jay Sussman, Scientific American, 255, no. 10, October 1987.", "``Numerical evidence that the motion of Pluto is chaotic,'' Gerald Jay Sussman and Jack Wisdom, in Science, 241, 22 July 1988.", "``The Outer Solar System for 200 Million Years,'' James Applegate, M. Douglas, Y. Gursel, Gerald Jay Sussman, Jack Wisdom, Astronomical Journal, 92, pp 176-194, July 1986, reprinted in Lecture Notes in Physics #267 -- Use of supercomputers in stellar dynamics, Springer Verlag, 1986.", "``A Digital Orrery,'' James Applegate, M. Douglas, Y. Gursel, P Hunter, C. Seitz, Gerald Jay Sussman, in IEEE Transactions on Computers, C-34, No. 9, pp. 822-831, September 1985, reprinted in Lecture Notes in Physics #267 -- Use of supercomputers in stellar dynamics, Springer Verlag, 1986.", "Structure and Interpretation of Computer Programs, Hal Abelson, Gerald Jay Sussman and Julie Sussman, MIT Press and McGraw-Hill, 1985, second edition 1996, (published translations in French, Japanese, and German).", "``A Model of the Radio-Continuum Filaments in the Galactic Center,'' P.J. Quinn and Gerald Jay Sussman, Astrophysics Journal, 288, No.1, pp. 377-384, January 1985.", "``The Best Length for a Mainspring,'' Gerald Jay Sussman with Julie Sussman, Newsletter of the Massachusetts Watchmaker's Association, pp. 8-11, June 1991. "], "study_areas": ["Classic AI-Bio"], "email": "gjs@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/1512"},
{"website": "http://www.mit.edu/~rcm", "bio": "\n <p>Rob Miller is a professor in the MIT EECS department and a member of the Computer Science and Artificial Intelligence Laboratory. He earned his Ph.D. in Computer Science from Carnegie Mellon University (2002). His doctoral research concerned intelligent interfaces and pattern languages for automated text editing, particularly of structured and semi-structured text. He received B.S. and M.Eng. degrees in EECS from MIT (1995).</p> \r\n\r\n <p>His research interests involve user interfaces and programming systems, in various combinations: (1) <i>end-user programming</i>, specifically for the web, to help people change and adapt the web applications they use every day; (2) <i>new UIs and tools for software developers</i>, to make their programming more effective and productive; and (3) <i>human computation and crowd computing</i>, which is about building systems that have people inside them, as integral components alongside traditional software.  In the past, he has also done work on usable security and programming by demonstration.</p> \n        ", "name": "Rob Miller", "title": "Professor", "phone": "+1 (617) 324-6028", "publications": ["Michael Bernstein, Robert C. Miller, Greg Little, Mark Ackerman, Bjoern Hartmann, David Karger, David Crowell, and Katrina Panovich.  \"", ".\" ACM Conference on User Interface Software and Technology (UIST), 2010. \r\n\r\n", "Greg Little, Lydia B. Chilton, Robert C. Miller, and Max Goldman. \"", "\"  ACM Conference on User Interface Software and Technology (UIST), 2010.\r\n\r\n", "Chen-Hsiang Yu and Robert C. Miller.  \"", ".\" ACM Conference on Human Factors in Computing Systems (CHI), 2010.\r\n\r\n", "Tsung-Hsiang Chang,Tom Yeh and Robert C. Miller. \"", ".\" ACM Conference on Human Factors in Computing Systems (CHI), 2010.\r\n\r\n", "Tom Yeh,Tsung-Hsiang Chang and Robert C. Miller. \"", ".\" ACM Conference on User Interface Software and Technology (UIST), 2009, pp. 183-192.\r\n\r\n", "Max Goldman and Robert C. Miller. \"", ".\" Journal of Visual Languages & Computing, v20 n4, 2009, pp. 223-235. \r\n\r\n", "Michael Bolin, Matthew Webber, Philip Rha, Tom Wilson, and Robert C. Miller. \"", ".\" ACM Conference on User Interface Software and Technology (UIST), 2005, pp 163-172."], "study_areas": ["Human computer interaction"], "email": "rcm@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/698"},
{"website": "http://people.csail.mit.edu/russt/", "bio": "\n <p>Russ Tedrake is an Associate Professor in the Department of Electrical Engineering and Computer Science at MIT, and a member of the Computer Science and Artificial Intelligence Lab. He received his B.S.E. in Computer Engineering from the University of Michigan, Ann Arbor, in 1999, and his Ph.D. in Electrical Engineering and Computer Science from MIT in 2004, working with Sebastian Seung. After graduation, he spent a year with the MIT Brain and Cognitive Sciences Department as a Postdoctoral Associate. During his education, he has spent time at Microsoft, Microsoft Research, and the Santa Fe Institute.</p> \r\n\r\n <p>Professor Tedrake's research group is interested in underactuated motor control systems in animals and machines that are capable of executing dynamically dexterous tasks and interacting with uncertain environments. They believe that the design of these control systems is intimately related to the mechanical designs of their machines, and that tools from machine learning and optimal control can be used to exploit this coupling when classical control techniques fail. Current projects include robust and efficient bipedal locomotion on flat terrain, multi-legged locomotion over extreme terrain, flapping-winged flight, and feedback control for fluid dynamics.</p> \n        ", "name": "Russ Tedrake", "title": "Associate Professor", "phone": "+1 (617) 253-1778", "publications": ["DARPA: MIT Team Qualified for DRC Finals (2013)", "DARPA: DRC Team qualified as part of the Virtual Robotics Challenge (2013)", "Hybrid Systems Computation and Control: Best Paper (2013)", "International Conference on Robotics and Automation: Best Paper (2013)", "MIT EECS: Spira Teaching Award (2012)", "Robotics: Science and Systems: Best Student Paper Award Finalist (2011)", "DARPA: Young Faculty Award (2009)", "Robotics: Science and Systems: Best Paper Award (2009)", "National Science Foundation: Career Award (2008)", "MIT: Jerome Saltzer Award (2008)", "Microsoft Research: New Faculty Fellowship Award (2008)"], "study_areas": ["Robotics"], "email": "russt@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/833"},
{"website": "http://people.csail.mit.edu/rus", "bio": "\n <p>Daniela Rus is a Professor of Electrical Engineering and Computer Science and Director of the Computer Science and Artificial Intelligence Laboratory (CSAIL) at MIT.  Prior to her appointment as Director, she served as Associate Director of CSAIL from 2008 to 2011, and as the Co-Director of CSAIL’s Center for Robotics from 2005 to 2012. She also leads CSAIL’s Distributed Robotics Laboratory. Rus is the first woman to serve as director of CSAIL, and its predecessors the AI Lab and the Lab for Computer Science.<br><br>Rus’ research interests include distributed robotics, mobile computing and programmable matter. At CSAIL she has led numerous groundbreaking research projects in the areas of transportation, security, environmental modeling and monitoring, underwater exploration, and agriculture. <br><br>Her research group, the Distributed Robotics Lab, has developed modular and self-reconfiguring robots, systems of self-organizing robots, networks of robots and sensors for first-responders, mobile sensor networks, techniques for cooperative underwater robotics, and new technology for desktop robotics. They have built robots that can tend a garden, bake cookies from scratch, cut a birthday cake, fly in swarms without human aid to perform surveillance functions, and dance with humans. Rus is also a champion of youth outreach, spearheading several programs that encourage students to pursue careers in computer science. <br><br>Rus is the recipient of the NSF Career Award and an Alfred P. Sloan Foundation Fellow.  She is a Class of 2002 MacArthur Fellow and a fellow of AAAI and IEEE. She serves on the scientific advisory board for the Max Planck Institute, on the editorial board for the Journal of Autonomous Robots, and on the long-term planning board for the IEEE Robotics and Automation Society. <br><br>Rus earned her PhD in Computer Science from Cornell University. Prior to coming to MIT, Rus was an assistant professor, associate professor, and professor in the Computer Science Department at Dartmouth College.<br> </p> \n        ", "name": "Daniela Rus", "title": "Director", "phone": "+1 (617) 258-7567", "publications": ["Distributed Motion Planning for 3D MOdular Robots with Unit-Compressible Modules (with Z. Butler), to appear in IJRR 2003 Also in proceedings of WAFR 2003.", "Networked Robots: Flying Robot Navigation with a Sensor Net (with P. Corke and R. Peterson), in Proceedings of the 2003 International Symposium on Robotics Research.", "Power Delivery and Locomotion of Untethered Micro-Actuators (with B. Donald, C. Levey, C. McGray, and M. Sinclair), to appear in IEEE JMEMS 2003. Also in Porceedings of ISRR 2003.", "Distributed Algorithms for Guiding Navigation Across a Sensor Net (with Q. Li and M. deRosa), in Proceedings of Mobicom 2003.", "Reconfiguration Planning for Heterogeneous Self-reconfiguring Robots (with R. Fitch and Z. Butler), in Proceedings of IROS 2003."], "study_areas": ["Robotics"], "email": "rus@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/876"},
{"website": "http://people.csail.mit.edu/karger", "bio": "\nDavid Karger (A.B. Summa cum laude in Computer Science, 1989, Harvard University, Ph.D., 1994, in Computer Science, Stanford University) is a Professor of Computer Science and a member of the Computer Science and Artificial Intelligence Laboratory at the Massachusetts Institute of Technology. Karger splits his research between algorithms and information retrieval. His work in algorithms has focused on applications of randomization to optimization problems and led to significant progress on several core problems. He has also researched applications of theoretical ideas to applied areas such as compilers and networks. His dissertation received the 1994 ACM doctoral dissertation award and the Mathematical Programming Society's 1997 Tucker Prize. His research in information retrieval has focused on new interfaces and algorithms for helping people sift effectively through large masses of information. His work on the Scatter/Gether browsing system at Xerox PARC led to two patents. More recently he has been researching retrieval systems that personalize themselves to best fit their individual users' needs and behaviors. He recently received the National Academy of Science's 2004 Award for Initiative in research.\r\n <p>\r\nDavid leads the <a href=\"http://haystack.csail.mit.edu/\">Haystack</a> group at CSAIL, which researches many facets of information management including capture, organization, retrieval, sharing, and visualization.\n        </p>", "name": "David Karger", "title": "Professor", "phone": "+1 (617) 258-6167", "publications": [], "study_areas": ["Theory", "Algorithms", "Personal Information Management"], "email": "karger@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/1542"},
{"website": "http://csail.mit.edu/~bkph", "bio": "\n <p>University of the Witwatersrand, B.Sc. (Eng.), Dec. 1965</p> \r\n\r\n <p>MIT, S.M., June 1968</p> \r\n\r\n <p>MIT, Ph.D., June 1970</p> \r\n\r\n <p>See also <a href=\"http://csail.mit.edu/~bkph\">http://csail.mit.edu/~bkph</a></p> \n        ", "name": "Berthold Horn", "title": "Professor", "phone": "+1 (617) 253-5863", "publications": ["Winston, P.H. & B.K.P. Horn, “LISP”\u009d, Addison-Wesley, Reading, Massachusetts, 1981. Second edition 1984. Third edition 1989.", "Horn, B.K.P. “Robot Vision”\u009d, MIT Press, Cambridge, Massachusetts & McGraw-Hill, New York, 1986.", "Horn, B.K.P. & M.J. Brooks (eds.) “Shape from Shading”\u009d, MIT Press, Cambridge Massachusetts, 1989."], "study_areas": ["Machine Vision & Computational Imaging"], "email": "bkph@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/802"},
{"website": "http://www.csail.mit.edu/~tlp", "bio": "\nTomas Lozano-Perez is the School of Engineering Professor of Teaching Excellence at MIT, where he is a member of the Computer Science and Artificial Intelligence Laboratory. Professor Lozano-Perez has all his degrees (SB '73, SM '76, PhD '80) from MIT in Computer Science. He has been Associate Director of the Artificial Intelligence Laboratory and Associate Head for Computer Science of MIT's Department of Electrical Engineering and Computer Science. Professor Lozano-Perez's research has been in robotics (configuration-space approach to motion planning), computer vision (interpretation-tree approach to object recognition), machine learning (multiple-instance learning), medical imaging (computer-assisted surgery) and computational chemistry (drug activity prediction and protein structure determination from NMR & X-ray data).\n        ", "name": "Tomas Lozano-Perez", "title": "Professor", "phone": "+1 (617) 253-7889", "publications": ["Lawson L.S. Wong, Leslie Pack Kaelbling, Tomas Lozano-Perez. Not Seeing is Also Believing: Combining Object and Metric Spatial Information, IEEE Conference on Robotics and Automation (ICRA), 2014.", "Patrick R. Barragan, Leslie Pack Kaelbling, Tomas Lozano-Perez. Interactive Bayesian Identification of Kinematic Mechanisms, IEEE Conference on Robotics and Automation (ICRA), 2014.", " George D. Konidaris, Leslie Kaelbling, Tomas Lozano-Perez. Constructing Symbolic Representations for High-Level Planning, Conference on Artificial Intelligence (AAAI), 2014.", " Caelan Reed Garrett, Tomas Lozano-Perez, Leslie Pack Kaelbling. FFRob: An efficient heuristic for task and motion planning, International Workshop on the Algorithmic Foundations of Robotics (WAFR), 2014.", " Tomas Lozano-Perez, Leslie Pack Kaelbling. A constraint-based method for solving sequential manipulation planning problems, IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS), 2014.", "\r\n", "Leslie Pack Kaelbling, Tomas Lozano-Perez. Integrated Task and Motion Planning in Belief Space, International Journal of Robotics Research, 2013.", "Lawson L.S. Wong, Leslie Pack Kaelbling, Tomas Lozano-Perez. Manipulation-based Active Search for Occluded Objects, IEEE Conference on Robotics and Automation (ICRA), 2013.", "Anne Holladay, Jennifer Barry, Leslie Pack Kaelbling, Tomas Lozano-Perez. Object Placement as Inverse Motion Planning, IEEE Conference on Robotics and Automation (ICRA), 2013. ", "Dylan Hadfield-Menell, Leslie Pack Kaelbling, Tomas Lozano-Perez. Optimization in the Now: Dynamic Peephole Optimization for Hierarchical Planning, IEEE Conference on Robotics and Automation (ICRA), 2013. ", "Jennifer Barry, Leslie Pack Kaelbling, Tomas Lozano-Perez. A Hierarchical Approach to Manipulation with Diverse Actions, IEEE Conference on Robotics and Automation (ICRA), 2013. ", "Lawson L.S. Wong, Leslie Pack Kaelbling, Tomas Lozano-Perez. Constructing Semantic World Models from Partial Views, Robotics: Science and Systems (RSS) Workshop on Robots in Clutter, 2013. ", "Martin Levihn, Leslie Pack Kaelbling, Tomas Lozano-Perez, Mike Stilman. Foresight and Reconsideration in Hierarchical Planning and Execution, IEEE/RSJ International Conference on Intelligent Robots and Systems, 2013."], "study_areas": ["Robotics & Learning"], "email": "tlp@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/810"},
{"website": "http://nms.csail.mit.edu/~guttag/", "bio": "\n <p>From January of 1999 through August of 2004, Professor Guttag served as Head of MIT's Electrical Engineering and Computer Science Department. He served as Associate Department Head from Computer Science from 1993 to 1998. EECS, with approximately 1800 students and 125 faculty members, is the largest department at MIT.</p> \r\n\r\n <p>Professor Guttag currently co-heads the Computer Science and Artificial Intelligence Laboratory's Networks and Mobile Systems Group. This group studies issues related to computer networks, applications of networked and mobile systems, and advanced software-based medical instrumentation and decision systems.</p> \r\n\r\n <p>Professor Guttag has also done research, published, and lectured in the areas of software engineering, mechanical theorem proving, hardware verification, compilation, and software radios.</p> \r\n\r\n <p>In addition to his academic activities, Professor Guttag has had long-term consulting relationships with a number of industrial research and advanced development organizations. He has also worked for many years as a consultant specializing in the analysis of information systems related business opportunities and risks. He currently serves on the technical advisory boards of Vanu, Inc., on the Board of Directors of Empirix, Inc., and on the Board of Trustees of the MGH Institute of Health Professions. He is also a member of the American Academy of Arts and Sciences and a Fellow of the ACM.</p> \r\n\r\n <p>Prof. Guttag earned an A.B. in English and an M.S. in Applied Mathematics from Brown University, and a Ph.D. in Computer Science from the University of Toronto.</p> \n        ", "name": "John Guttag", "title": "Professor", "phone": "+1 (617) 253-6022", "publications": ["Association for Computing Machinery: Fellow (2006)", "American Academy of Arts and Sciences: Fellow (2005)"], "study_areas": ["Applications of computer science to medicine"], "email": "guttag@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/798"},
{"website": "http://people.csail.mit.edu/people/lpk", "bio": "\nLeslie Pack Kaelbling is Professor of Computer Science and Engineering and Research Director of the Computer Science and Artificial Intelligence Laboratory (CSAIL) at the Massachusetts Institute of Technology. She has previously held positions at Brown University, the Artificial Intelligence Center of SRI International, and at Teleos Research. She received an A. B. in Philosophy in 1983 and a Ph. D. in Computer Science in 1990, both from Stanford University. Prof. Kaelbling has done substantial research on designing situated agents, mobile robotics, reinforcement learning, and decision-theoretic planning. In 2000, she founded the Journal of Machine Learning Research, a high-quality journal that is both freely available electronically as well as published in archival form; she currently serves as editor-in-chief. Prof. Kaelbling is an NSF Presidential Faculty Fellow, a former member of the AAAI Executive Council, the 1997 recipient of the IJCAI Computers and Thought Award, a trustee of IJCAII and a fellow of the AAAI.\n        ", "name": "Leslie Kaelbling", "title": "Professor", "phone": "+1 (617) 258-9695", "publications": ["MacVicar: Fellow (2012)", "International Joint Conference on Artificial Intelligence: Computers and Thought Award (1997)"], "study_areas": ["Language & Learning"], "email": "lpk@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/808"},
{"website": "http://people.csail.mit.edu/welg/", "bio": "\n <a href=\"http://orgchart.mit.edu/chancellor-academic-advancement\" target=\"_blank\">http://orgchart.mit.edu/chancellor-academic-advancement</a> <br> <br> \r\nEric Grimson is a Professor of Computer Science and Engineering at the Massachusetts Institute of Technology, and holds the Bernard Gordon Chair of Medical Engineering at MIT. He also holds a joint appointment as a Lecturer on Radiology at Harvard Medical School and at Brigham and Women's Hospital. Between 2011 and 2014 he served as the Chancellor for MIT, having previously served as the Head of the Department of Electrical Engineering and Computer Science at MIT. He currently serves as Chancellor for Academic Advancement for MIT.  He received a B.Sc. (High Honors) in Mathematics and Physics from the University of Regina in 1975 and a Ph.D. in Mathematics from MIT in 1980. Prof. Grimson's research group pioneered state of the art systems for activity and behavior recognition, object and person recognition, image database indexing, image guided surgery, site modeling and many other areas of computer vision. Prof. Grimson is a Fellow of the American Association for Artificial Intelligence (AAAI), a Fellow of the IEEE, and was awarded the Bose Award for Excellence in Teaching in the School of Engineering at MIT.\n        ", "name": "Eric Grimson", "title": "Chancellor for Academic Advancement", "phone": "+1 (617) 253-5415", "publications": ["Association for Computing Machinery: Fellow (2014)", "Neural Information Processing Systems (NIPS): Best paper (2010)", "Institute of Electrical and Electronics Engineers: Fellow (2004)", "Association for the Advancement of Artificial Intelligence : Fellow (2000)"], "study_areas": ["Vision & Graphics"], "email": "welg@mit.edu", "profile_link": "http://www.csail.mit.edu/user/807"},
{"website": "http://people.csail.mit.edu/polina", "bio": "\n <p>Polina Golland is an Associate Professor of Electrical Engineering and Computer Science at MIT. Her research interests span computer vision and machine learning. Her current work focuses on developing statistical analysis methods for characterization of biological processes using images (from MRI to microscopy) as a source of information.</p> \r\n\r\n <p>She received BSc and Masters in Computer Science from Technion, Israel in 1993 and 1995, and a PhD in Electrical Engineering and Computer Science from MIT in 2001. She joined the faculty in 2003.</p> \r\n\n        ", "name": "Polina Golland", "title": "Professor", "phone": "+1 (617) 253-8005", "publications": ["T. Riklin-Raviv, K. Van Leemput, B. Menze, W.M. Wells III, and\r\nP. Golland. Joint\r\nSegmentation of Image Ensembles via Latent Atlases. Medical Image\r\nAnalysis, 14(5):654-665, 2010.\r\n\r\n", "\r\nW. Ou, A. Nummenmaa, J. Ahveninen, J.W. Belliveau,\r\nM.S. Hamäläinen, and P. Golland. Multimodal functional imaging\r\nusing fMRI-informed regional EEG/MEG source estimation.\r\nNeuroImage, 52(1):97-108, 2010.\r\n\r\n", "\r\nD. Lashkari, E. Vul, N.G. Kanwisher, and P. Golland. Discovering structure in\r\nthe space of fMRI selectivity profiles.  NeuroImage, 3(15):1085-1098,\r\n2010.\r\n\r\n", "\r\nM.R. Sabuncu, S.K. Balci, M.E. Shenton, and\r\nP. Golland. Image-Driven\r\nPopulation Analysis Through Mixture Modeling.  IEEE Transactions\r\non Medical Imaging, 28(9):1473 - 1487, 2009.\r\n\r\n", "\r\nB.T.T. Yeo, W. Ou and P. Golland.  \r\nOn the Construction of Invertible\r\nFilter Banks on the 2-Sphere.IEEE Transactions on Image Processing,\r\n17(3):283-300, 2008.\r\n\r\n", "\r\nP. Golland, W.E.L. Grimson, M.E. Shenton, R. Kikinis. \r\nDetection and Analysis of Statistical Differences in Anatomical\r\nShape. Medical Image Analysis, 9(1):69-86, 2005.\r\n\r\n\r\n\r\n"], "study_areas": ["Vision & Graphics"], "email": "polina@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/791"},
{"website": "http://www.psrg.lcs.mit.edu/~gifford", "bio": "\nDavid Gifford develops new machine learning techniques and algorithms to model the transcriptional regulatory networks that control gene expression programs in living cells. Our group has a very productive interdisciplinary collaboration with leading biologists that has allowed us to tackle extraordinarily difficult and interesting problems that underlie cellular function and development. Current work in our laboratory is examining how we can computationally model chromatin modifying complexes that are associated with the genome of living yeast cells. New kinds of mechanistic computational models are necessary to capture how chromatin structure encodes cellular memory, and how the state of this memory is used to control gene expression. In particular, we are investigating new modular graphical models that use mechanistic constraints to describe biological mechanism. A new focus is an interdisciplinary project that seeks to build computational models of the transcriptional regulatory networks that control the differentiation of specific cell types. Elucidating these regulatory networks will enable us to define the regulatory processes that determine a cell's progress to its terminally differentiated state, and position us to differentiate embryonic stem (ES) cells for the treatment of debilitating human diseases. New computational techniques for elucidating transcriptional regulatory networks based on the integration of diverse high-throughput experimental data (genome sequence, chromatin structure, transcription factor-DNA binding, gene expression) provide a powerful foundation for discovering the detailed mechanisms of regulatory network control of cell differentiation during development.\n        ", "name": "Dave Gifford", "title": "Professor", "phone": "+1 (617) 253-6039", "publications": ["Bar-Joseph, Z., Gerber, G. K., Lee, T. I., Rinaldi, N. J., Yoo, J. Y., Robert, F., Gordon, D. B., Fraenkel, E., Jaakkola, T. S., Young, R. A., Gifford, D. K. Computational discovery of gene modules and regulatory networks. Nature Biotechnology 21, 1337 - 1342 (01 Nov 2003)", "Odom, D. T., Zizlsperger, N., Gordon, D. B., Bell, G. W., Rinaldi, N. J., Murray, H. L., Volkert, T. L., Schreiber, J., Rolfe, P. A., Gifford, D. K., Fraenkel, E., Bell, G. I., Young, R. A. Control of Pancreas and Liver Gene Expression by HNF Transcription Factors\".. Science, 303:1378-1381, February, 2004.", "Harbison, C., Gordon, D. B., Lee, T. I., Rinaldi, N. J., MacIsaac, K. D., Danford, T. W., Hannett, N. M., Tagne, J. B., Teynolds, D. B. Yoo, J., Jennings, E. G., Zeitlinger,J., Pokholok, D. K. Kennis, M., Rolfe, P. A., Takusagawa, K.T., Lander, E. S., Gifford, D. K., Fraenkel, E., and Young, R. A., \"Transcriptional regulatory code of a eukaryotic genome\". Nature, 431:99-104, September, 2004.", "Robert F, Pokholok DK, Hannett NM, Rinaldi NJ, Chandy M, Rolfe A, Workman JL, Gifford DK, Young RA, Global position and recruitment of HATs and HDACs in the yeast genome, Mol Cell. 16(2):199-209, October, 2004.", "Pokholok, D.K., Harbison, C.T., Levine, S., Cole, M., Hannett, N.M., Lee, T.I., Walker, K., Lewitter, F., Rolfe, P.A., Herbolsheimer, E., Bell, G.W., Zeitlinger, J., Gifford, D.K., Young, R.A. Genome-wide Map of Nucleosome Acetylation and Methylation in Yeast. Cell, in press (2005).", "Singh, R, Palmer, N., Gifford, D., Berger, B., Bar-Joseph, Z. Active Learning for Sampling in Time-Series Experiments, With Application to Gene Expression Analysis. International Conference on Machine Learning, in press (2005) "], "study_areas": ["Theory-Bio"], "email": "gifford@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/989"},
{"website": "https://billf.mit.edu/", "bio": "\n <p>William T. Freeman is a Professor in the Electrical Engineering and Computer Science Department at MIT.  A member of the Computer Science and Artificial Intelligence Laboratory, he joined the MIT the faculty in September, 2001.</p> \r\n <p>From 1992 - 2001 he worked at Mitsubishi Electric Research Labs (MERL), in Cambridge, MA, most recently as Sr. Research Scientist and Associate Director. He studied computer vision for his PhD in 1992 from the Massachussetts Institute of Technology, and received a BS in physics and MS in electrical engineering from Stanford in 1979, and an MS in applied physics from Cornell in 1981.</p> \r\n <p>His current research interests include machine learning applied to computer vision, Bayesian models of visual perception, and interactive applications of computer vision. In 1997, he received the Outstanding Paper prize at the Conference on Computer Vision and Pattern Recognition for work on applying bilinear models to \"separating style and content\". Previous research topics include steerable filters and pyramids, the generic viewpoint assumption, color constancy, and computer vision for computer games. He holds 15 patents.</p> \r\n <p>From 1981 - 1987, he worked at the <a href=\"http://www.polaroid.com/index.jsp\">Polaroid Corporation</a>. There he co-developed an electronic printer (Polaroid Palette) , and developed algorithms for color image reconstruction which are used in Polaroid's electronic camera . In 1987-88, Dr. Freeman was a Foreign Expert at the <a href=\"http://www.tyut.edu.cn/newsite/\">Taiyuan University of Technology</a>, P. R. of China.</p> \r\n <p>Dr. Freeman was an Associate Editor of IEEE Trans. on Pattern Analysis and Machine Intelligence (IEEE-PAMI), and is a member of the IEEE PAMI TC Awards Committee. He has been active in the program or organizing committees of the International Conference on Face and Gesture Recognition, Computer Vision and Pattern Recognition (CVPR), the International Conference on Computer Vision (ICCV), Neural Information Processing Systems (NIPS), and SIGGRAPH.</p> \n        ", "name": "William Freeman", "title": "Professor", "phone": "+1 (617) 253-8828", "publications": ["Institute of Electrical and Electronics Engineers: FG Test of Time Award (2013)", "IEEE International Conference on Computer Vision: Test of Time Award (2013)", "Neural Information Processing Systems (NIPS): Outstanding Student Paper Award (2006)"], "study_areas": ["Vision & Graphics"], "email": "billf@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/800"},
{"website": "http://people.csail.mit.edu/cjt/", "bio": "\n <p>Chris Terman is a Senior Lecturer in the EECS Dept. and a member of the Computer Architecture Group in CSAIL. Terman implemented several early prototypes for microprocessor-based workstations that led to the development of the IEEE-1196 Bus Architecture (the NuBus) which introduced the idea of plug-and-play peripherals. In his work on CAD tools for VLSI circuits, Terman developed several algorithms for full-chip transistor-level timing simulation including SIM which was widely used in industry and academia.</p> \r\n <p>During 10 years in industry, Terman cofounded several firms, including Symbolics Inc. (manufacturer of Lisp Machines), TLW Inc. (VLSI designs for communications and multimedia), and Curl Co. (software technology for the Web). After returning to MIT, Terman has worked on developing educational technology for use in teaching design-oriented courses.</p> \n        ", "name": "Chris Terman", "title": "Senior Lecturer", "phone": "+1 (617) 253-6038", "publications": ["Allen, J. and Terman C. \"An Interactive Learning Environment for VLSI Design,\" Proc. IEEE, January 2000.", "Ackland, B., Terman C., et al. \"A Single-Chip 1.6Billion 16-b MAC/s Multiprocessor DSP,\" Custom Integrated Circuits Conference, San Diego, CA, May 1999.", "Ward, S., Terman, C., et al. \"Curl: A Gentle-slope Language for the Web,\" World Wide Web Journal, Vol. 2, No. 2, pp. 121-134, Spring 1997.", "Terman, C. \"Timing Simulation for Large Digital MOS Circuits,\" in Advances in Computer-Aided Engineering Design, A. Sangiovanni-Vincentelli ed., JAI Press Inc., 1985, pages 1-91."], "study_areas": ["Architecture"], "email": "cjt@mit.edu", "profile_link": "http://www.csail.mit.edu/user/660"},
{"website": "http://people.csail.mit.edu/asolar/", "bio": "", "name": "Armando Solar-Lezama", "title": "Assistant Professor", "phone": "+1 (617) 258-9727", "publications": ["Conference on Innovative Data Systems Research: Best Paper Award (2013)"], "study_areas": ["Programming Systems", "Parallel and High-performance computing"], "email": "asolar@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/1792"},
{"website": "http://web.mit.edu/manoli/www/", "bio": "\n <p>I am a professor of Computer Science at MIT in the area of Computational Biology.  I am a member of the Computer Science and Artificial Intelligence Laboratory (CSAIL), and of the Broad Institute of MIT and Harvard.</p> \r\n <p>My research interests are in the area of computational biology, genomics, epigenomics, gene regulation, and genome evolution. Specifically:</p> \r\n <p>(1) in the area of genome interpretation, we seek to develop comparative genomics methods to identify genes and regulatory elements systematically in the human genome</p> \r\n <p>(2) in the area of gene regulation, we seek to understand the regulatory motifs involved in cell type specification during development, understand their combinatorial relationships, and how these establish expression domains in the developing embryo.</p> \r\n <p>(3) in the area of epigenomics, we seek to understand the chromatin signatures associated with distinct activity states, the changing chromatin states across different cell types and during differentiation, and the sequencing signals responsible for the establishment and maintenance of chromatin marks.</p> \r\n <p>(4) in the area of evolutionary genomics, understanding the dynamics of gene phylogenies across complete genes, the emergence of new gene functions by duplication and mutation, and the algorithmic principles behind phylogenomics.</p> \n        ", "name": "Manolis Kellis", "title": "Professor", "phone": "+1 (617) 253-2419", "publications": ["\r\n     ", "\r\n     ", "\r\n     ", "\r\n     ", "\r\n     ", "\r\n     ", "\r\n     ", "\r\n     ", "\r\n    ", "\r\n    ", "\r\n     ", "\r\n     ", "\r\n     ", "\r\n     ", "\r\n     ", "\r\n     ", "\r\n     ", "\r\n     ", "\r\n     ", "\r\n     ", "\r\n     ", "\r\n     ", "\r\n     ", "\r\n     ", " ", " "], "study_areas": ["Epigenomics", "comparative genomics", "ENCODE", "Roadmap", "GTEx", "genetic variation", "human disease", "personal genomics"], "email": "manoli@mit.edu", "profile_link": "http://www.csail.mit.edu/user/1562"},
{"website": "http://people.csail.mit.edu/sanchez", "bio": "", "name": "Daniel Sanchez", "title": "Assistant Professor", "phone": "+1 (617) 715-4886", "publications": [], "study_areas": [""], "email": "sanchez@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/2990"},
{"website": "http://www.pmg.csail.mit.edu/~liskov", "bio": "\n <p>Barbara Liskov is an Institute Professor and head of the Programming Methodology Group. Liskov's research interests lie in programming methodology, programming languages and systems, and distributed computing. Major projects include: the design and implementation of CLU, the first language to support data abstraction; the design and implementation of Argus, the first high-level language to support implementation of distributed programs; and the Thor object-oriented database system, which provides transactional access to persistent, highly-available objects in wide-scale distributed environments. Her current research interests include Byzantine-fault-tolerant storage systems, peer-to-peer computing, and support for automatic deployment of software upgrades in large-scale distributed systems.</p> \r\n\r\n <p>Liskov is a member of the National Academy of Engineering, and a fellow of the American Academy of Arts and Sciences, and the Association for Computer Machinery. She received The Society of Women Engineers' Achievement Award in 1996 and the IEEE von Neumann medal in 2004.  At the ACM SIGPLAN Programming Languages Design and Implementation Conference in 2008, she was awarded the Programming Languages Achievement Award.  In 2009, she received the A.M. Turing Award from ACM.</p> \n        ", "name": "Barbara Liskov", "title": "Institute Professor", "phone": "+1 (617) 253-5886", "publications": ["Liskov, B., \"Abstraction Mechanisms in CLU,\" Comm. Of the ACM 20, August 1977, 564-576 (with A. Snyder, R.Atkinson and C. Schaffert)", "Liskov, B., \"Distributed Programming in Argus,\" Comm. Of the ACM 31, March 1988, 300-312", "Liskov, B., \"Practical Uses of Synchronized Clocks in Distributed Systems,\" Distributed Computing 6, August 1993, 211-219", "Liskov, B., \"A Behavioral Notion of Subtyping,\" ACM Transactions on Programming Languages nd Systems 16:6, November 1994, 1811-1841 (with J. Wing)", "Liskov, B., \"HAC: Hybrid Adaptive Caching for Distributed Storage Systems,\" Proceedings of the 17th Symposium on Operating Systems Principles, October 1997, 102-115 (with M. Castro, A. Adya, and A. Myers)", "Liskov, B., \"A Decentralized Model for Information Flow Control,\" Proceedings of the 17th Symposium on Operating Systems Principles, October 1997, 129-147 (with A. Myers)", "Liskov, B., \"Practical Byzantine Fault Tolerance and Proactive Recovery,\" Transactions on Computer Systems 20(4), November 2002, 398-461 (with M. Castro)", "Liskov, B., \"BASE: Using Abstraction to Improve Fault Tolerance,\" ACM Transactions on Computer Systems 21(3), August 2003, 236-269 (with R. Rodrigues and M. Castro)", "Path Vector Face Routing: Geographic Routing with Local Face Information. In Proceedings of the 13th IEEE International Conference on Network Protocols (ICNP 2005). Boston, Massachusetts, November 2005. (with B.Leong and S.Mitra).", "Geographic Routing Without Planarization. In Proceedings of the 3rd Symposium on Network Systems Design and Implementation (NSDI 2006). San Jose, California. April 2006. (with B.Leong and R.Morris).", "Tolerating Byzantine Faulty Clients in a Quorum System. In Proceedings of the 26th International Conference on Distributed Computing Systems (ICDCS 2006). Lisbon, Portugal. July 2006. (with R.Rodrigues).", "Automatic Software Upgrades for Distributed Systems. In Proceedings of the European Conference on Object-oriented Programming (ECOOP 2006). Nantes, France. July 2006. (with S.Ajmani and L.Shrira).", "HQ Replication: A Hybrid Quorum Protocol for Byzantine Fault Tolerance. To appear in Proceedings of the 7th Symposium on Operating Systems Design and Implementation (OSDI 2006). Seattle, Washington, November 2006. (with J.Cowling, D.Myers, R.Rodrigues, and L.Shrira).", " Tolerating Byzantine Faults in Transaction Processing Systems Using Commit Barrier Scheduling (SOSP 2007). Stevenson, Washington, October, 2007. (with B.Vandiver, H.Balakrishnan, and S.Madden).\r\n"], "study_areas": ["Systems & Networking"], "email": "liskov@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/971"},
{"website": "http://www.pdos.csail.mit.edu/~rtm/", "bio": "\nRobert Morris is an assistant professor in MIT's EECS department and a member of the Computer Science and Artificial Intelligence Laboratory. He received a PhD from Harvard University for work on modeling and controlling networks with large numbers of competing connections. As a graduate student he helped design and build an ARPA-funded ATM switch with per-circuit hop-by-hop flow control. He led a mobile communication project which won a best student paper award from USENIX. He co-founded Viaweb, an e-commerce hosting service. His current interests include modular software-based routers, analysis of the aggregation behavior of Internet traffic, and scalable ad-hoc routing.\n        ", "name": "Robert Morris", "title": "Professor", "phone": "+1 (617) 253-5983", "publications": ["Jinyang Li, John Jannotti, Douglas S. J. De Couto, David R Karger, Robert Morris, â€œA Scalable Location Service for Geographic Ad Hoc Routingâ€\u009d, ACM Mobicom 2000, Boston, MA.", "R. Morris, E. Kohler, J. Jannotti, M. Frans Kaashoek, â€œThe Click Modular Routerâ€\u009d, In the Proceedings of the 17th ACM Symposium on Operating Systems Principles (SOSP â€™99), Kiawah Island, South Carolina, December 1999, pages 217-231.", "Lin, D., And Morris, R., â€œDynamics of Random Earl Detection,â€\u009d SIGCOMM 1997 Conference. "], "study_areas": ["Systems & Networking"], "email": "rtm@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/972"},
{"website": "http://db.lcs.mit.edu/madden", "bio": "\nProfessor Madden's research is in the area of database systems, focusing on query processing over streams, sensors, and other networked information sources. He joined the faculty in January, 2004 receiving his Ph.D. in 2003 from the University of California, Berkeley.\n        ", "name": "Sam Madden", "title": "Professor", "phone": "+1 (617) 258-6643", "publications": ["Conference on Innovative Data Systems Research: Best Paper Award (2013)", "Association for Computing Machinery: EuroSys Conference Best Paper Award (2012)", "IBM: Faculty Research Award (2007)", "Sloan Foundation: Research Fellowship (2007)", "International Conference on Very Large Data Bases: Best Paper Award (2007)", "Association for Computing Machinery: Best Demo Award, SenSys Conf. (2006)", "Association for Computing Machinery: Best Paper Award| MOBICOM Conf (2006)", "National Science Foundation: Career Award (2005)", "Technology Review: TR35 - Top 35 Innovator Under the Age of 35 (2005)", "International Conference on Very Large Data Bases: Best Paper Award (2004)", "UC Berkeley: C.V. Ramamoorthy Distinguished Research Award (2003)"], "study_areas": ["Systems & Networking"], "email": "madden@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/877"},
{"website": "http://research.microsoft.com/Lampson/", "bio": "\n <p>Butler Lampson is a Distinguished Engineer at Microsoft Corporation and an Adjunct Professor of Computer Science and Electrical Engineering at MIT. He was on the faculty at Berkeley and then at the Computer Science Laboratory at Xerox PARC and at DigitalÃ¢â\u0082¬â\u0084¢s Systems Research Center. He has worked on computer architecture, local area networks, raster printers, page description languages, operating systems, remote procedure call, programming languages and their semantics, programming in the large, fault-tolerant computing, transaction processing, computer security, WHSIWYG editors, and tablet computers. He was one of the designers of the SDS 940 time-sharing system, the Alto personal distributed computing system, the Xerox 9700 laser printer, two-phase commit protocols, the Autonet LAN, the SPKI system for network security, the Microsoft Palladium security system, the Microsoft Tablet PC software, and several programming languages.</p> \r\n\r\n <p>He received an AB from Harvard University, a PhD in EECS from the University of California at Berkeley, and honorary ScDÃ¢â\u0082¬â\u0084¢s from the EidgenÃ\u0083Â¶ssische Technische Hochschule, Zurich and the University of Bologna. He holds a number of patents on networks, security, raster printing, and transaction processing. He is a member of the National Academy of Engineering and a Fellow of the Association for Computing Machinery and the American Academy of Arts and Sciences. He received the ACM Software Systems Award in 1984 for his work on the Alto, the IEEE Computer Pioneer award in 1996, the National Computer Systems Security Award in 1998, the IEEE von Neumann Medal in 2001, the Turing Award in 1992, and the National Academy of EngineeringÃ¢â\u0082¬â\u0084¢s Draper Prize in 2004. </p> \n        ", "name": "Butler Lampson", "title": "Adjunct Professor", "phone": "+1 (617) 253-6004", "publications": ["Computer security in the real world, IEEE Computer 39, 6 (June 2004)", "A trusted open platform, IEEE Computer 36, 7, July 2003 (with England et al)", "SDSI - A Simple Distributed Security Infrastructure. http://theory.lcs.mit.edu/~cis/sdsi.html, 1996 (with R. Rivest).", "Analysis and caching of dependencies. ACM SigPlan International Conference on Functional Programming, Philadelphia, May 1996 (with Abadi and Levy)", "Authentication in the Taos operating system. ACM Trans. Computer Systems 12, 1, Feb. 1994 (with Abadi et al)", "Authentication in distributed systems: Theory and practice. ACM Trans. Computer Systems 10, 4, Nov. 1992 (with Abadi et al)", "Reliable messages and connection establishment. In Distributed Systems, ed. S. Mullender, 2nd ed., Addison-Wesley, 1993", "A kernel language for modules and abstract data types. Information and Computation 76, 2/3, Feb./Mar. 1988 (with R. Burstall).", "Personal distributed computing: The Alto and Ethernet software. In A History of Personal Workstations, ed. A. Goldberg, Addison-Wesley, 1988", "Hints on computer system design. IEEE Software 1, 1, Jan. 1984", "Practical use of a polymorphic applicative language. Proc. 10th ACM Symposium on Principles of Programming Languages, 1983 (with E. Schmidt)", "Alto: A personal computer. In Computer Structures: Principles and Examples, ed. Siewiorek, Bell and Newell, McGraw Hill, 1981 (with Thacker et al)", "Experience with processes and monitors in Mesa. Comm. ACM 23, 2, Feb. 1980 (with D. Redell)", "An open operating system for a single user machine. ACM Operating Systems Rev. 11, 5, Dec. 1979 (with R. Sproull)", "Reflections on an operating system design. Comm. ACM 19, 5, May 1976 (with H. Sturgis).", "Lampson, Protection. ACM Operating Systems Rev. 8, 1 (Jan. 1974)", "A note on the confinement problem. Comm. ACM 16, 10, Oct. 1973", "A user machine in a time sharing system. Proc. IEEE 54, 12, Dec. 1966. Reprinted in Computer Structures, ed. Bell and Newell, McGraw Hill, 1971, pp 291 300 (with Pirtle and Lichtenberger) "], "study_areas": ["Architecture"], "email": "blampson@microsoft.com", "profile_link": "http://www.csail.mit.edu/user/1575"},
{"website": "http://people.csail.mit.edu/dina", "bio": "\nMy research interests are in computer networks and data communication. They encompass congestion control, network measurements, scalability and robustness of communication systems, differentiated services, Internet pricing, routing, content distribution, peer-to-peer systems, self-configurable and wireless networks, and network security. I have a particular interest in adapting tools from various fields of applied mathematics such as control theory, coding theory, and AI to solve problems in computer networks.\n        ", "name": "Dina Katabi", "title": "Professor", "phone": "+1 (617) 324-6027", "publications": ["Dina Katabi, Mark Handley, and Charles Rohrs, \"Internet Congestion Control for High Bandwidth-Delay Product Networks.\" ACM Sigcomm 2002, Pittsburgh, August, 2002.", "Dina Katabi and Charles Blake, \"Inferring Congestion Sharing and Path Characteristics from Packet Interarrival Times.\" LCS Technical Report, 2001.", "Dina Katabi and Mark Handley, \" Using Precise Feedback for Controlling Congestion in the Internet.\" MIT-LCS Technical Report 820.", "Dina Katabi, Issam Bazzi, and Xiaowei Yang, \" A Passive Approach for Detecting Shared Bottlenecks.\" IEEE International Conference on Computer Communications and Networks, ICCCN 2001, Arizona 2001.", "Dina Katabi and Mark Handley, \" Enhancing Internet Congestion Control Using Explicit and Precise Feedback.\" A 2-page paper published in Oxygen 2001 Workshop, July 2001.", "Dina Katabi and John Wroclawski, \" A Framework for Scalable Global IP-Anycast (GIA).\" Best Student Paper award, SIGCOMM 2000.", "Dina Katabi \" The Use of IP-Anycast for Building Efficient Multicast Trees.\" Global Internet'99, Costa Rica, 1999.", "Dina Katabi, Issam Bazzi, and Xiaowei Yang, \"An Information Theoretic Approach for Shared Bottleneck Inference Based on End-to-end Measurements.\" MIT-LCS Technical Memo 604.", "Issam Bazzi and Dina Katabi, \"Using Support Vector Machines for Spoken Digit Recognition.\" Proc. of 6th International Conference on Spoken Language Processing (ICSLP), Beijing, China, October 2000."], "study_areas": ["Systems & Networking"], "email": "dina@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/687"},
{"website": "http://www.pdos.csail.mit.edu/~kaashoek/", "bio": "\nM. Frans Kaashoek is a professor in MIT's EECS Department and a member of the Computer Science and Artificial Intelligence Laboratory. He received his PhD from the Vrije Universiteit (Amsterdam, The Netherlands) for his work on group communication in the Amoeba distributed operating system. His principal field of interest is designing and building computer systems. Some of the current projects that he is working on with students include exokernels, an extensible operating system architecture, and SFS, a secure, decentralized global file system.\n        ", "name": "Frans Kaashoek", "title": "Professor", "phone": "+1 (617) 253-7149", "publications": ["\"Application performance and flexibility on exokernel systems.\" M. Frans Kaashoek, Dawson R. Engler, Gregory R. Ganger, Hector M. Briceno, Russell Hunt, David Mazieres, Thomas Pinckney, Robert Grimm, John Jannotti, and Kenneth Mackenzie. In Proceedings of the 16th ACM Symposium on Operating Systems Principles, Saint Malo, France, 1997.", "tcc: A system for fast, flexible, and high-level dynamic code generation. by Massimiliano Poletto, Dawson R. Engler, and M. Frans Kaashoek. In Proceedings of Programming Languages Design and Implementation, 1997.", "David Mazieres and M. Frans Kaashoek. The design, implementation and operation of an email pseudonm server. In Proceedings of the 5th ACM Conference on Computer and Communications Security, 1998. "], "study_areas": ["Systems & Networking"], "email": "kaashoek@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/1525"},
{"website": "http://people.csail.mit.edu/dnj", "bio": "\n <p>Daniel Jackson is a professor in the Department of Electrical Engineering and Computer Science, and leads the Software Design Group in the Computer Science and Artificial Intelligence Laboratory. He received an MA from Oxford University (1984) in Physics, and his SM (1988) and PhD (1992) from MIT in Computer Science. He was a software engineer for Logica UK Ltd. (1984-1986), Assistant Professor of Computer Science at Carnegie Mellon University (1992-1997), and has been at MIT since 1997.</p> \r\n\r\n <p>He has broad interests in software engineering, especially in development methods, design and specification, formal methods, and safety critical systems.</p> \n        ", "name": "Daniel Jackson", "title": "Professor", "phone": "+1 (617) 258-8471", "publications": ["ACM Special Interest Group on Software Engineering: Distinguished Paper Award (2015)", "MIT EECS: Bose Award for Excellence in Teaching (2010)", "MIT EECS: MacVicar Faculty Fellow (2009)", "IBM: Faculty Research Award (2003)"], "study_areas": ["Architecture"], "email": "dnj@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/727"},
{"website": "http://csg.lcs.mit.edu/~devadas", "bio": "\n <p>Srini Devadas is the Webster Professor of Electrical Engineering and Computer Science and has has been on the MIT EECS faculty since 1988. He served as Associate Head of the Department of Electrical Engineering and Computer Science, with responsibility for Computer Science, from 2005 to 2011.\r\n</p> <p>\r\nDevadas's research interests span Computer-Aided Design (CAD), computer security and computer architecture and he has received significant awards from each discipline. In 2015, he received the ACM/IEEE A. Richard Newton Technical Impact award in Electronic Design Automation. He received the IEEE Computer Society Technical Achievement Award in 2014 for inventing Physical Unclonable Functions and single-chip secure processor architectures. Devadas's work on hardware information flow tracking published in the 2004 ASPLOS received the ASPLOS Most Influential Paper Award in 2014. His papers on analytical cache modeling and the Aegis single-chip secure processor were included as influential papers in \"25 Years of the International Conference on Supercomputing.\" He is an IEEE and ACM Fellow.</p> \n        ", "name": "Srini Devadas", "title": "Professor", "phone": "+1 (617) 253-0454", "publications": ["Gassend, B., D. Clarke, M. van Dijk, and S. Devadas, ``Silicon Physical Random Functions'', Proceedings of the Computer and Communication Security Conference, November 2002.", "Suh, G., E., C. O'Donnell, I. Sachdev, and S. Devadas, ``Design and Implementation of the Aegis Secure Processor Using Physical Random Functions'', Proceedings of the Int'l Symposium on Computer Architecture, June 2005."], "study_areas": ["Computer security", "computer architecture"], "email": "devadas@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/792"},
{"website": "http://www.csg.csail.mit.edu/Users/dennis/", "bio": "\n <p>As the original leader of the Computation Structures Group, Professor Dennis led the development of dataflow models of computation and novel principles of computer architecture inspired by dataflow models. He is currently engaged in research on functional programming principles and related principles of computer architecture, and is applying these concepts in the design of a novel advanced multiprocessor chip for general-purpose computing.</p> \r\n\r\n <p>Prof. Dennis received the 1984 Eckert-Mauchly Award for contributions to the field of computer architecture, and is a Fellow of the IEEE and of the ACM.</p> \r\n\n        ", "name": "Jack Dennis", "title": "Professor Emeritus", "phone": "+1 (617) 253-6856", "publications": ["Jack B. Dennis. A Parallel Program Execution Model Supporting Modular Software Construction. In \"Proceedings of the Third Working Conference on Massively Parallel Programming Models: MPPM-97\", pp 50-60. IEEE Computer Society, 1997.", "Jack B. Dennis. Stream data types for signal processing. In \"Advances in Dataflow Architecture and Multithreading\", J.-L. Gaudiot and L. Bic, editors. IEEE Computer Society Press, 1995.", "Jack B. Dennis. The evolution of 'static' data-flow architecture. In \"Advanced Topics in Data-Flow Computing\", J.-L. Gaudiot and L. Bic, Eds., pp 35-91. Englewood Cliffs: Prentice-Hall, 1991.", "Jack B. Dennis. First version of a data flow procedure language. In \"Lecture Notes in Computer Science 19: Programming Symposium\", pp 362-376. Springer-Verlag: Berlin, New York, 1974."], "study_areas": ["Architecture"], "email": "dennis@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/1552"},
{"website": "http://larch-www.lcs.mit.edu:8001/~corbato/", "bio": "\n <p>Fernando J. Corbato, Professor Emeritus in the Department of Electrical Engineering and Computer Science at M.I.T., has achieved wide recognition for his pioneering work on the design and development of multiple-access computer systems. He was associated with the M.I.T. Computation Center from its organization in 1956 until 1966. In 1963 he was a founding member of Project MAC, the antecedent of CSAIL. An early version of the Compatible Time-Sharing System (CTSS) was first demonstrated in November 1961, at the M.I.T. Computation Center. In the fall of 1963, after further development, the system began daily operation at Project MAC.</p> \r\n\r\n <p>Out of the CTSS experience, further research and development began of a new system, Multics (Multiplexed Information and Computing Service). Multics became available for general use at M.I.T. in October 1969 and a Honeywell product in 1973. Fernando Corbato received his Ph.D. from M.I.T. in 1956 in Physics. He was appointed Associate Professor in 1962, promoted to Professor in 1965, and was Associate Department Head for Computer Science and Engineering during 1974-78 and 1983-93. At retirement in 1996, he held a Ford Professor of Engineering Chair.</p> \n        ", "name": "F. J. Corbato", "title": "Professor Emeritus", "phone": "+1 (617) 253-6001", "publications": ["The Compatible Time-Sharing System: A Programmer's Guide, (coauthored), M.I.T. Press, June 1963.", "\"Introduction and Overview of the MulticsSystem,\" (with Vyssotsky, V. A.), Proceedings of the FJCC, 1965.", "\"A Managerial View of the Multics System Development,\" (with Clingen, C. T.) in Research Directions in Software Technology edited by P., Wegner, M.I.T. Press, 1979. (Also published in Tutorial: Software Management, Reifer, Donald J. (ed), IEEE Computer Society Press, l979; 2nd Edition l981; 3rd Ed., 1986.)", "Turing Award Lecture: \"On Building Systems that will Fail\" CACM 34, No. 9, 73-81, Sep. 1991."], "study_areas": ["Computer Systems"], "email": "corbato@mit.edu", "profile_link": "http://www.csail.mit.edu/user/1539"},
{"website": "http://www.w3.org/People/Berners-Lee", "bio": "\n <p>A graduate of Oxford University, England, Tim is now with the Computer Science and Artificial Intelligence Laboratory at the Massachusetts Institute of Technology (MIT). He directs the W3 Consortium, an open forum of companies and organizations with the mission to realize the full potential of the Web.</p> \r\n\r\n <p>With a background of system design in real-time communications and text processing software development, in 1989 he invented the World Wide Web, an internet-based hypermedia initiative for global information sharing. While working at CERN, the European Particle Physics Laboratory. He wrote the first web browser and server in 1990.</p> \r\n\r\n <p>Before coming to CERN, Tim worked with Image Computer Systems, of Ferndown, Dorset, England and before that a principal engineer with Plessey Telecommunications, in Poole, England.</p> \n        ", "name": "Tim Berners-Lee", "title": "Professor", "phone": "+1 (617) 253-5702", "publications": ["\"", "\", Harper San Francisco, 1999"], "study_areas": ["W3C"], "email": "timbl@w3.org", "profile_link": "http://www.csail.mit.edu/user/769"},
{"website": "http://cag.csail.mit.edu/~saman/", "bio": "\nSaman P. Amarasinghe is a Professor in the Department of Electrical Engineering and Computer Science. He leads the Commit compiler group. His research interests are in discovering novel approaches to improve the performance of modern computer systems and make them more secure without unduly increasing the complexity faced by the end users, application developers, compiler writers, or computer architects. Saman received his BS in Electrical Engineering and Computer Science from Cornell University in 1988, and his MSEE and Ph.D from Stanford University in 1990 and 1997, respectively.\r\n\n        ", "name": "Saman Amarasinghe", "title": "Professor", "phone": "+1 (617) 253-8879", "publications": ["Andrew A. Lamb, William Thies, and Saman Amarasinghe. Linear Analysis and Optimization of Stream Programs. In Proceedings of the SIGPLAN '03 Conference on Programming Language Design and Implementation, June, 2003.", "Mark Stephenson, Saman Amarasinghe, Martin C. Martin, and Una-May O'Reilly. Meta Optimization: Improving Compiler Heuristics with Machine Learning. In Proceedings of the SIGPLAN '03 Conference on Programming Language Design and Implementation, June, 2003.", "Michael Gordon, William Thies, Michal Karczmarek, Jasper Lin, Ali S. Meli, Christopher Leger, Andrew A. Lamb, Jeremy Wong, Henry Hoffman, David Z. Maze, and Saman Amarasinghe. A Stream Compiler for Communication-Exposed Architectures. In ASPLOS 2002, October, 2002.", "Vladimir Kiriansky, Derek Bruening, and Saman Amarasinghe. Secure Execution Via Program Shepherding. In Proceedings of the 11th USENIX Security Symposium, August, 2002.", "Rajeev Barua, Walter Lee, Saman Amarasinghe, and Anant Agarwal. Compiler Support for Scalable and Efficient Memory Systems. In Transactions on Computers, November, 2001.", "Detecting Coarse-Grain Parallelism Using an Interprocedural Parallelizing Compiler. M. W. Hall, S. P. Amarasinghe, B. R. Murphy, S. Liao, and M. S. Lam. Proceedings of Supercomputing '95, December 1995."], "study_areas": ["Compilers", "Programming Languages", "High Performance Computing", "Computer Security", "Computer Architecture", "Information Technology for Development"], "email": "saman@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/693"},
{"website": "http://cag.csail.mit.edu/~agarwal/", "bio": "\nAnant Agarwal is the CEO of\r\n\r\n <a href=\"http://www.edx.org/\">edX</a> ,\r\n\r\nan online learning destination\r\n\r\nfounded by Harvard and MIT. Anant taught the first edX course on\r\n\r\ncircuits and electronics from MIT, which drew 155,000 students from\r\n\r\n162 countries. He has served as the director of\r\n\r\n <a href=\"http://www.csail.mit.edu\">CSAIL</a> ,\r\n\r\nMIT's Computer\r\n\r\nScience and Artificial Intelligence Laboratory, and is a professor of\r\n\r\nelectrical engineering and computer science at\r\n\r\n <a href=\"http://web.mit.edu/\">MIT</a> .\r\n\r\nHe is a successful\r\n\r\nserial entrepreneur, having co-founded several companies including\r\n\r\n <a href=\"http://www.tilera.com\">Tilera Corporation</a> ,\r\n\r\nwhich created the Tile multicore processor, and\r\n\r\nVirtual Machine Works.\r\n\r\n \r\n\r\n <p>\r\n\r\nAnant won the Maurice Wilkes prize for\r\n\r\ncomputer architecture, and MIT's Smullin and Jamieson prizes for\r\n\r\nteaching. He holds a Guinness World Record for the largest microphone\r\n\r\narray, and is an author of the textbook \"Foundations of Analog and\r\n\r\nDigital Electronic Circuits.\"\r\n\r\n \r\n\r\n</p> <p>\r\n\r\nHis work on Organic Computing was\r\n\r\nselected by Scientific American as one of 10 World-Changing Ideas in\r\n\r\n2011, and he was named in Forbes' list of top 15 education innovators\r\n\r\nin 2012.\r\n\r\nAnant is a member of the National Academy of Engineering, a\r\n\r\nfellow of the American Academy of Arts and Sciences, and a fellow of\r\n\r\nthe ACM.\r\n\r\n \r\n\r\n</p> <p>\r\n\r\nHe hacks on <a href=\"http://euryale.csail.mit.edu/websim\">WebSim</a>, which is\r\n\r\nan online circuits laboratory in his spare time.\r\n\r\nAnant holds a Ph.D. from Stanford and a bachelor's from\r\n\r\nIIT Madras.\r\n\r\n \r\n\r\n</p> <p>\r\n\r\nAnant's twitter handle is @agarwaledu.\n        </p>", "name": "Anant Agarwal", "title": "Professor", "phone": "+1 (617) 253-1448", "publications": ["D. Wentzlaff, C. Gruenwald III, N. Beckmann, K. Modzelewski, A. Belay,  L. Youseff, J. Miller, and A. Agarwal. \" An Operating System for Multicore and Clouds: Mechanisms and Implementation \" ACM Symposium on Cloud Computing (SOCC), June 2010.", "M. B. Taylor, W. Lee, J. Miller, D. Wentzlaff, I. Bratt, B. Greenwald, H. Hoffmann, P. Johnson, J. Kim, J. Psota, A. Saraf, N. Shnidman, V. Strumpen, M. Frank, S. Amarasinghe, A. Agarwal. “Evaluation of the Raw Microprocessor: An Exposed-Wire-Delay Architecture for ILP and Streams.” In Proc. International Symposium on Computer Architecture, June 2004.", "A. Agarwal, R. Bianchini, D. Chaiken, K. Johnson, D. Kranz, J. Kubiatowicz, B. H. LIm, K. MacKenzie, and D. Yeung. \" The MIT Alewife Machine: Architecture and Performance.\" In proceedings of the 22nd Annual Internationsl Symposium on Computer Architecture (ISCA 1995), June 1995, pp 2-13", "David Wentzlaff and Anant Agarwal. \"Factored Operating Systems (fos): The Case for a Scalable Operating System for Multicores.\" In ACM SIGOPS Operating System Review, April 2009.", "Anant Agarwal, Liewei Bao, John Brown, Bruce Edwards, Matt Mattina, Chyi- Chang Miao, Carl Ramey, David Wentzlaff. \"Tile Processor: Embedded Multicore for Networking and Multimedia.\" Hotchips 2007.", "Anant Agarwal, \"Raw Computation,\" Scientific American, August 1999."], "study_areas": ["Computer architecture", "operating systems", "computer systems", "online learning", "education"], "email": "agarwal@edx.org", "profile_link": "http://www.csail.mit.edu/user/723"},
{"website": "http://people.csail.mit.edu/ronitt/", "bio": "\nRonitt Rubinfeld is a professor in the Department of Electrical Engineering and Computer Science and a member of the Computer Science and Artificial Intelligence Laboratory. Ronitt's main research area is theory of computation. Ronitt received her PhD from the University of California, Berkeley in 1991, and prior to that graduated from the University of Michigan with a BSE in Electrical and Computer Engineering. Before coming to MIT, Ronitt held postdoctoral researcher positions at Princeton University and Hebrew University. In 1992, she joined the faculty of the Computer Science Department at Cornell University, where she was an ONR Young Investigator, a Sloan Research Fellow, the 1995 Cornell Association for Computer Science Undergraduates Faculty of the Year, and a recipient of the Cornell College of Engineering Teaching Award. From 1999 to 2003, Ronitt was a Senior Research Scientist at NEC Research Laboratories, and in 2004, she was a Fellow at the Radcliffe Institute for Advanced Study.  <br> <br> \r\nRonitt's research interests include randomized and sublinear time algorithms. In particular, her work focuses on what can be understood about data by looking at only a very small portion of it. \n        ", "name": "Ronitt Rubinfeld", "title": "Professor", "phone": "+1 (617) 253-0884", "publications": ["\r\nBatu, T., Fortnow, L., Rubinfeld, R., Smith, W.D., White, P., \"Testing Closeness of Discrete Distributions,\" Journal of the ACM, 60(1):4, 2013. ", "Chazelle, B., Rubinfeld, R., Trevisan, L., \"Approximating the minimum spanning tree weight in sublinear time\", SIAM Journal on Computing, 34(6):1370-1379, 2005. ", "Batu, T., Fortnow, L., Rubinfeld, R., Smith, W.D., White, P., ``Testing that distributions are close'', Proc. 41st IEEE Conference on Foundations of Computer Science, pp. 259-269, 2000.", "Chazelle, B., Rubinfeld, R., Trevisan, L., ``Approximating the minimum spanning tree weight in sublinear time'', Proceedings of ICALP, pp. 190--200, 2001.", "T.Batu, F.Ergun, J.Kilian, A.Magen, S.Raskhodnikova, R.Rubinfeld, and Rahul Sami. ``A sublinear algorithm for weakly approximating edit distance''. Proceedings of the Thirty-Fifth Annual ACM Symposium on the Theory of Computing, pages 316--324, 2003.", "Blum, M., Luby, M., Rubinfeld, R., ``Self-Testing/Correcting with Applications to Numerical Problems,'' J. Comp. Sys. Sci., Vol. 47, No. 3, pp. 549-595, December 1993. "], "study_areas": ["Theory-Bio"], "email": "ronitt@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/896"},
{"website": "http://www.csg.csail.mit.edu/Users/arvind/", "bio": "\nArvind is the Johnson Professor of Computer Science and Engineering at MIT. Arvind’s group, in collaboration with Motorola, built the Monsoon dataflow machines and its associated software in the late eighties. In 2000, Arvind started Sandburst which was sold to Broadcom in 2006. In 2003, Arvind co-founded Bluespec Inc., an EDA company to produce a set of tools for high-level synthesis. In 2001, Dr. R. S. Nikhil and Arvind published the book \"Implicit parallel programming in pH\". Arvind's current research focus is on enabling rapid development of embedded systems.\r\n <p>Arvind is a Fellow of IEEE and ACM, and a member of the National Academy of Engineering and the American Academy of Arts and Sciences<br>\r\n </p> \n        ", "name": "Arvind Mithal", "title": "Professor", "phone": "+1 (617) 253-6090", "publications": [], "study_areas": ["Architecture"], "email": "arvind@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/849"},
{"website": "http://theory.csail.mit.edu/~rivest", "bio": "\n <p>Professor Rivest is the Vannevar Bush Professor of Electrical  Engineering and Computer Science in MIT's Department of Electrical Engineering and Computer Science, and a leader of the Cryptography and Information Security research group within MIT's Computer Science and Artificial Intelligence Laboratory. He received a B.A. in Mathematics from Yale University in1969, and a Ph.D. in Computer Science from Stanford University in 1974.</p> \r\n\r\nHe is a Fellow of the Association for Computing Machinery and of the American Academy of Arts and Sciences, and is also a member of the National Academy of Engineering.\r\n\r\n <p>Professor Rivest is an inventor of the RSA public-key cryptosystem, and a founder of RSA Data Security. He has extensive experience in cryptographic design and cryptanalysis, and has published numerous papers in these areas. He has served a Director of the International Association for Cryptologic Research, the organizing body for the Eurocrypt and Crypto conferences, and of the Financial Cryptography Association. He has also worked extensively in the areas of computer algorithms, machine learning, and VLSI design.</p> \n        ", "name": "Ronald Rivest", "title": "Institute Professor", "phone": "+1 (617) 253-5880", "publications": ["MIT: Institute Professor (2015)", "National Cyber Security Hall of Fame: National Cyber Security Hall of Fame Award (2012)", "RSA: Lifetime Achievement Award (2011)", "NEC: Computers and Communications Award (2009)", "The Marconi Society: Marconi Prize (2007)", "Massachusetts Innovation and Technology Exchange: Lifetime member (2005)", "National Academy of Sciences: Member (2004)", "Association for Computing Machinery: A.M. Turing Award (2002)", "Institute of Electrical and Electronics Engineers: Kobayashi Award (2000)", "Association for Computing Machinery: Fellow (1994)", "American Academy of Arts and Sciences: Fellow (1993)", "National Academy of Engineering: Member (1990)"], "study_areas": ["Cryptography", "security", "algorithms", "voting systems"], "email": "rivest@mit.edu", "profile_link": "http://www.csail.mit.edu/user/1294"},
{"website": "http://people.csail.mit.edu/silvio/", "bio": "\n <p>Born in Palermo, Italy, Silvio Micali received his Ph.D. in Computer Science from the University of California at Berkeley in 1983. He joined MIT in 1983, where he is Ford Professor of Engineering.</p> \r\n\r\n <p>His scientific interests include complexity-based pseudorandom generation and cryptography, interactive and computationally sound proofs, zero knowledge, secure protocols, and mechanism design. </p> \r\n\r\n <p>He is the recipient of the Goedel prize (in theoretical computer science) and the RSA prize (in cryptography), and is a member of the National Academy of Sciences, the National Academy of Engineering, and the American Academy of Arts and Sciences.\r\n\n        </p>", "name": "Silvio Micali", "title": "Professor", "phone": "+1 (617) 253-5949", "publications": ["Carnegie Corporation of New York: Great Immigrants The Pride of America (2015)", "Association for Computing Machinery: A.M. Turing Award (2013)", "MIT: Ford Professor of Engineering (2011)", "National Academy of Sciences: Member (2008)", "National Academy of Engineering: Member (2007)", "University of California Berkeley| CS Division: Distinguished Alumni Award (2006)", "University of Pennsylvania: Rademacher Lecture Series (2005)", "RSA: Mathematics Award (2004)", "American Academy of Arts and Sciences: Fellow (2003)", "Godel: Gödel Prize in Theoretical Computer Science (1993)"], "study_areas": ["Theory-Bio"], "email": "silvio@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/994"},
{"website": "http://theory.csail.mit.edu/~meyer/", "bio": "\n <p>Prof. Meyer has been at MIT since 1969. He is best known for his contributions to computational complexity theory, including the formulation of the POLYNOMIAL-TIME HIERARCHY and the first proofs of the exponential complexity of known decision problems. He has contributed extensively to Type Theory and Semantics of programming languages and concurrent processes. As an outgrowth of his recent responsibility for several large introductory courses, he has become interested in educational technology.</p> \r\n\r\n <p>Prof. Meyer has supervised twenty-six Ph.D students, many now prominent researchers on the faculty of leading departments throughout the country. He is a member of numerous professional societies and editorial boards, is a member of the American Academy of Arts and Science, and is Editor-in-Chief of the journal Information and Computation. </p> \n        ", "name": "Albert R. Meyer", "title": "Professor", "phone": "+1 (617) 253-6024", "publications": ["Stockmeyer, L. and A.R. Meyer, ``Cosmological lower bound on the circuit complexity of a small problem in logic,'' JACM 49, 6 (2002), 753-784.", "Jim, T. and A.R. Meyer, \"Full Abstraction and the Context Lemma,\" SIAM J. Computation 25, 3 (1996), 663--696.", "Bruce, K.B., A.R. Meyer and J.C. Mitchell, \"The Semantics of Second-Order Lambda Calculus,\" Information and Computation, 85 (1990), 76--134. Reprinted in: Gerard Huet, editor. LOGICAL FOUNDATIONS OF FUNCTIONAL PROGRAMMING, chapter 10, pp213--272. University of Texas at Austin Year of Programming Series. Addison-Wesley Publishing Company, 1990.", "Mayr, E. and A.R. Meyer, \" The Complexity of the Word Problems for Commutative Semigroups and Polynomial Ideals,\" Advances in Mathematics, 46,3 (1982), 305--329.", "Stockmeyer, L. and A.R. Meyer, \"Word Problems Requiring Exponential Time,\" 5th ACM Symp. on Theory of Computing, (May, 1973), 1--10. "], "study_areas": ["Complexity Theory", "Logic & Semantics of Programs", "Educational Technology"], "email": "meyer@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/993"},
{"website": "http://theory.csail.mit.edu/~lynch/", "bio": "\n <p>Nancy Lynch is the NEC Professor of Software Science and Engineering in the EECS department and heads the Theory of Distributed Systems research group at the Computer Science and Artificial Intelligence Laboratory. She has written numerous research articles about distributed algorithms and impossibility results, and about formal modeling and validation of distributed systems. She is the author of the graduate textbook \"Distributed Algorithms\" and a co-author of the monograph \"The Theory of Timed I/O Automata\". She is a member of the National Academy of Engineering, an ACM Fellow, and a winner of several prizes for contributions to distributed computing theory.</p> \r\n\r\n <p>Prof. Lynch's academic training was in mathematics, at Brooklyn College and MIT. She served on the mathematics and computer science faculty at several other universities, including the University of Southern California and Georgia Tech, prior to joining the MIT faculty in 1982. Since then, she has been working on applying mathematics to the tasks of understanding and constructing complex distributed systems. Her current projects involve designing algorithms for mobile wireless networks, and analyzing timed and hybrid systems and security protocols. </p> \n        ", "name": "Nancy Lynch", "title": "Professor", "phone": "+1 (617) 253-7225", "publications": ["Nancy Lynch. \"Distributed Algorithms\". Morgan Kaufmann Publishers, Inc., San Mateo, CA, March 1996.", "Dilsun K. Kaynar, Nancy Lynch, Roberto Segala, and Frits Vaandrager. \"The Theory of Timed I/O Automata\". Synthesis Lectures on Computer Science, Morgan Claypool Publishers, 2006. Revised and shortened version of Technical Report MIT-LCS-TR-917a (from 2004).", "Michael J. Fischer, Nancy A. Lynch, and Michael S. Paterson. \"Impossibility of Distributed Consensus with One Faulty Process\". Journal of the ACM, 32(2):374-382, April 1985. Winner of Dijkstra Prize, 2001.", "Cynthia Dwork, Nancy Lynch, and Larry Stockmeyer. \"Consensus in the Presence of Partial Synchrony\". Journal of the ACM, April 1988. Winner of Dijkstra Prize, 2007.", "Seth Gilbert, Nancy Lynch, and Alex Shvartsman. \"RAMBO: A Robust, Reconfigurable Atomic Memory Service for Dynamic Networks\". Submitted for publication (see http://groups.csail.mit.edu/tds/reflist.html for pdf version).", "Shlomi Dolev, Seth Gilbert, Nancy A. Lynch, Alex A. Shvartsman, and Jennifer L. Welch. \"GeoQuorums: Implementing Atomic Memory in Mobile Ad Hoc Networks\". Distributed Computing, Special Issue DISC03, 18(2):125-155, 2005.", "Gregory Chockler, Seth Gilbert, and Nancy Lynch. \"Virtual Infrastructure for Collision-Prone Wireless Networks\". To appear in PODC 2008.", "Rui Fan and Nancy Lynch. \"Gradient Clock Synchronization\". Distributed Computing, 18(4):255-266, March 2006. Best Student Paper award at PODC 2004.", "Rui Fan and Nancy Lynch. \"An Omega(n log n) Lower Bound on the Cost of Mutual Exclusion\". Twenty-Fifth Annual ACM SIGACT-SIGOPS Symposium on Principles of Distributed Computing (PODC 2006), Denver, Colorado, July 2006. Best Student Paper award.", "Gregory Chockler, Murat Demirbas, Seth Gilbert, Calvin Newport, and Tina Nolte. \"Consensus and Collision Detectors in Wireless Ad Hoc Networks\". Twenty-Fourth Annual ACM SIGACT-SIGOPS Symposium on Principles of Distributed Computing (PODC 2005), Las Vegas, Nevada, pages 197-206, July 2005. New version to appear in Distributed Computing.", "Rachid Guerraoui, Maurice Herlihy, Petr Kouznetsov, Nancy Lynch, and Calvin Newport. \"On the Weakest Failure Detector Ever\". Twenty-Sixth Annual ACM Symposium on Principles of Distributed Systems (PODC 2007), Portland, Oregon, August 2007.", "Ran Canetti, Ling Cheung, Dilsun Kaynar, Moses Liskov, Nancy Lynch, Olivier Pereira, and Roberto Segala. \"Analyzing security protocols using time-bounded task-PIOAs\".", "Journal of Discrete Event Dynamic Systems, 2008."], "study_areas": ["Theory-Bio"], "email": "lynch@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/990"},
{"website": "http://supertech.csail.mit.edu/~cel/", "bio": "\n <p>Prof. Leiserson's research centers on the theory of parallel computing, especially as it relates to engineering reality. He wrote the first paper on systolic architectures with H.T. Kung and invented the retiming method of digital circuit optimization. He designed and led the implementation of the network architecture for the Connection Machine Model CM-5 Supercomputer produced by Thinking Machines Corporation, which incorporated the fat-tree interconnection network he developed at MIT. Fat-trees are now the preferred interconnect strategy for Infiniband technology. His textbook, <em>Introduction to Algorithms</em>, coauthored with Ronald L. Rivest and Thomas H. Cormen was named \"Best 1990 Professional and Scholarly Book in Computer Science and Data Processing\" by the Association of American Publishers. Currently in its third edition with an additional coauthor Clifford Stein, it is the leading textbook on computer algorithms and, according to <a target=\"_blank\" href=\"http://citeseerx.ist.psu.edu/\">Citeseerx</a> , the most cited reference in computer science. As Director of System Architecture at Akamai Technologies, he led the engineering team that developed a world-wide content-distribution network numbering over 20,000 servers. He introduced the notion of cache-oblivious algorithms, which exploit the memory hierarchy near optimally while containing no tuning parameters for cache size or cache-line length. He developed the Cilk multithreaded programming technology, which featured the first provably efficient work-stealing scheduler. He led the development of several Cilk-based parallel chess-playing programs which have won numerous prizes in international competition. With Matteo Frigo, he founded Cilk Arts, Inc., which developed the Cilk++ multicore concurrency platform and was acquired by Intel Corporation in 2009. He was for many years the head of the computer-science program for the Singapore-MIT Alliance distance-education collaboration. His annual workshop on <em>Leadership Skills for Engineering and Science Faculty</em>, cotaught with Chuck McVinney, has educated hundreds of faculty at MIT and around the world in the nontechnical issues involved in leading technical teams in academia. He is a Margaret MacVicar Faculty Fellow at MIT, the highest recognition at MIT for undergraduate teaching. He is an ACM Fellow and a senior member of IEEE and SIAM.</p> \n        ", "name": "Charles Leiserson", "title": "Professor", "phone": "+1 (617) 253-5833", "publications": ["Thomas H. Cormen, Charles E. Leiserson, and Ronald L. Rivest, ", ", MIT Press and McGraw-Hill, 1990. Translated into eight languages.", "Matteo Frigo, Charles E. Leiserson, and Keith Randall, \"The implementation of the Cilk-5 multithreaded language,\" ", ", Montreal, Canada, June 1998, pp. 212-223.", "C. Scott Ananian, Krste Asanovic, Bradley C. Kuszmaul, Charles E. Leiserson, Sean Lie, \"Unbounded transactional memory,\" ", ", 2006, to appear.  An early version appeared in the ", ", San Francisco, CA, February 2005, pp. 316-327."], "study_areas": [""], "email": "cel@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/960"},
{"website": "http://theory.csail.mit.edu/~shafi/", "bio": "\nShafi Goldwasser is the RSA Professor of Electrical Engineering and Computer Science in MIT, a co-leader of the cryptography and information security group and a member of the complexity theory group within the Theory of Computation Group and the Computer Science and Artificial Intelligence Laboratory.\n        ", "name": "Shafi Goldwasser", "title": "Professor", "phone": "+1 (617) 253-5914", "publications": ["Goldwasser, S., Micali S.,, and Rackoff C. ``The Knowledge Complexity of Interactive Proof Systems'', SIAM J. of Computing, Vol. 18, no. 1, January 1989.", "Ben-Or, M., Goldwasser S., and Wigderson A., ``Completeness Theorems for Non-Cryptographic Fault Tolerant Distributed Computation'', Proceedings of 20th Annual ACM Symposium on Theory of Computing, Chicago, Illinois, May 1988, pp. 1-10. Invited to special issue of Journal of Computer Science and Systems.", "Canneti, R., Goldreich, O., Goldwasser S., , and Micali S. ``Resettable Zero Knowledge '', Proceedings of the 32nd Annual ACM Symposium on Theory of Computing (STOC), pages 235-244, Portland, Oregon, May 2000.", "Barak B., Goldreich O., Goldwasser S., and Lindell Y. ``Resettably-Sound Zero-Knowledge and its Applications,'' Proceedings of the 42nd Annual Symposium on Foundations of Computer Science (FOCS), pages 116-125, Las Vegas, Nevada, October 2001.", "Goldwasser S. and Lindell, Y. ``Secure Computation without Agreement,'' 16th Int'l Symposium on DIStributed Computing (DISC), pages 17-32, Toulouse, France, October 2002.", "Feige, U., Goldwasser, S., Lovasz, L., S. Safra, M. Szegedi., ``Interactive Proofs and the Hardness of Approximating Cliques'', Journal of the ACM, Vol. 43, No 2., March 1996, pp. 268-292.", "Golderich, O., Goldwassr S., and Ron D., ``Property Testing and Its Relation to Learning and Approximation'', Journal of the ACM, pages 653-750, July 1998.", "Goldwasser, S., Kilian J., ''Primality Testing based on Elliptic Curves'', Journal of the ACM, Volume 46, Number 4, pages 450-472, July 1999.", "Golderich, O., Goldwasser S., ''On the Limits of Non-Approximability of Lattice Problems'', Journal of Computer and System Sciences, Volume 60, Number 3, pages 540-563, June 2000. "], "study_areas": ["Theory-Bio"], "email": "shafi@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/733"},
{"website": "http://erikdemaine.org/", "bio": "\n \n        ", "name": "Erik Demaine", "title": "Professor", "phone": "+1 (617) 253-6871", "publications": ["European Association for Theoretical Computer Science: Nerode Prize (2015)", "EECS: Steven and Renee Finn Innovation Fellow (2013)", "John Simon Guggenheim Memorial Foundation: Fellow (2013)", "European Association for Theoretical Computer Science: Presburger Award (2013)", "Science Atlantic: Outstanding Student, Hall of Fame (2012)", "Mathematical Association of America: Polya Lecturer (2011)", "Smithsonian: Pieces in permanent collection (2011)", "Mathematical Association of America: Polya Lecturer (2010)", "Carnegie Mellon University and Tokyo University of Technology: Katayanagi Emerging Leadership Prize (2008)", "Francqui Foundation: International Francqui Chair (2007)", "Dalhousie University: Honorary Doctor of Laws (2007)", "Sloan Foundation: Research Fellowship (2006)", "MIT: Edgerton Award (2005)", "Popular Science: Brilliant 10 (2004)", "MIT EECS: Spira Teaching Award (2004)", "National Science Foundation: Career Award (2004)", "Natural Sciences and Engineering Research Council of Canada (NSERC): NSERC Doctoral Prize (2003)", "MacArthur Foundation: MacArthur Fellows Program (2003)"], "study_areas": ["Theory", "Algorithms"], "email": "edemaine@mit.edu", "profile_link": "http://www.csail.mit.edu/user/666"},
{"website": "http://people.csail.mit.edu/indyk", "bio": "\n <p>Piotr joined MIT in September 2000, after earning PhD from Stanford University. Earlier, he received Magister degree from Uniwersytet Warszawski in 1995. As of July 2010, he holds the title of Professor in the Department of Electrical Engineering and Computer Science.</p> \r\n <p>Piotr's research interests include algorithms for high-dimensional geometric problems, algorithms using sublinear time and/or space and streaming algorithms.</p> \n        ", "name": "Piotr Indyk", "title": "Professor", "phone": "+1 (617) 452-3402", "publications": ["International Conference on Machine Learning: Best Paper (2015)", "The Simons Foundation: Simons Investigator (2013)", "Technology Review: 10 Emerging Technologies That Will Change the World (2012)", "MIT EECS: Faculty Research Innovation Fellowship (2012)", "Association for Computing Machinery: Paris Kanellakis Theory and Practice Award (2012)", "Packard Foundation: Packard Fellowship (2003)", "Sloan Foundation: Research Fellowship (2003)", "National Science Foundation: Career Award (2002)", "FOCS: Best student paper (2000)"], "study_areas": ["Theory"], "email": "indyk@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/1540"},
{"website": "http://people.csail.mit.edu/costis", "bio": "\n <b><span>Constantinos</span></b> <span> (or <b>Costis</b>) <b>Daskalakis</b>  is the X-Window Associate Professor of Electrical Engineering and Computer  Science, a member of  the Computer Science and Artificial Intelligence Laboratory (CSAIL),  and an affiliate of the Laboratory for Information and Decision  Systems (LIDS) and the Operations Research Center (ORC). </span> He completed his undergraduate studies in Greece, at the  National Technical University of Athens, and obtained a PhD in Computer  Science from UC Berkeley. After Berkeley he was a postdoctoral  researcher in Microsoft Research New England, and has been  at the faculty of MIT since 2009. <span><br><br>\r\nCostis is interested in Algorithmic Game  Theory and Applied Probability, particularly in computational aspects of  markets and the Internet, in social networks, and in computational  problems in Biology. His research is motivated by two questions: \"how  does the algorithmic perspective influence Economics, Biology and Physics?\" and \"how does the study of computational  problems arising from areas outside Computer Science transform the  Theory of Computation?\" </span> \r\n <p class=\"MsoNormal\"><span>Costis and  his collaborators, Paul Goldberg and Christos Papadimitriou, were honored by the Game Theory Society with the  first Game Theory and Computer Science Prize for their work on the  Computational Complexity of Nash equilibria. Their same work was honored with the 2011 SIAM Outstanding Paper Prize.  Costis was also the recipient of the</span><span> 2006 Best Student Paper Award at the ACM Conference on  Electronic Commerce,</span><span> </span><span>a 2007 Microsoft Graduate Research Fellowship, the </span><span>2008 ACM Doctoral Dissertation Award, a 2010 Sloan Foundation fellowship in Computer Science,</span><span> the 2011 MIT Ruth and Joel Spira Award</span> for Distinguished Teaching, and a 2012 Microsoft Research Faculty Fellowship.</p> \n        ", "name": "Costis Daskalakis", "title": "Associate Professor", "phone": "+1 (617) 253-9643", "publications": ["ACM Special Interest Group Electronic Commerce: Best Student Paper (2013)", "Association for Computing Machinery: Conference on Electronic Commerce Best Paper (2013)", "Association for Computing Machinery: Conference on Electronic Commerce Best Student Paper (2012)", "Microsoft: New Faculty Fellowship Award (2012)", "MIT EECS: Spira Teaching Award (2011)", "SIAM: Outstanding Paper (2011)", "National Science Foundation: Career Award (2010)", "Sloan Foundation: Research Fellowship (2010)", "Game Theory Society: Game Theory and Computer Science Prize (2008)", "Association for Computing Machinery: Doctoral Dissertation Award (2008)", "Microsoft: Research Fellowship (2007)", "Association for Computing Machinery: Best Student Paper Award (2006)"], "study_areas": ["Algorithmic Game Theory", "Applied Probability", "Computational Biology"], "email": "costis@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/1825"},
{"website": "http://www.scottaaronson.com/", "bio": "\nScott Aaronson is Associate Professor of Electrical Engineering and \r\nComputer Science, and a member of the Theory of Computation and Complexity Theory groups. He holds a PhD in computer science from University of California, Berkeley, a bachelor's degree from Cornell University, and a GED (General Equivalency Diploma) from New York State. Before coming to MIT, Scott worked as a postdoctoral researcher at the Institute for Advanced Study in Princeton, NJ from 2004-2005, and at the Institute for Quantum Computing at the University of Waterloo in Ontario, Canada from 2005-2007.\r\n <br> <br> \r\nScott's research interests center around fundamental limits on what can efficiently be computed in the physical world. This has entailed studying quantum computing, the most powerful model of computation we have based on known physical theory. Scott's work on this subject has included limitations of quantum algorithms in the black-box model; the learnability of quantum states; quantum proofs and advice; the power of postselected quantum computing and quantum computing with closed timelike curves; and linear-optical quantum computing. Scott also maintains an active interest in many topics in classical theoretical\r\ncomputer science, including circuit lower bounds, computational learning theory, and communication complexity.\r\n\n        ", "name": "Scott Aaronson", "title": "Associate Professor", "phone": "+1 (617) 324-8356", "publications": ["National Science Foundation: Alan T. Waterman Award (2012)", "MIT CSAIL: United States Presidential Early Career Award for Scientists and Engineers (PECASE) (2010)", "Sloan Foundation: Fellow (2009)", "MIT EECS: Junior Bose Teaching Award (2009)", "UC Berkeley: David J. Sakrison Memorial Prize (2005)", "ACM Symposium on Theory of Computing 204: Danny Lewin Best Student Paper Award (2004)", "IEEE Conference on Computational Complexity: Best Student Paper Award (2004)", "IEEE Conference on Computational Complexity: Best Student Paper Award (2003)", "UC Berkeley: C.V. Ramamoorthy Distinguished Research Award (2002)"], "study_areas": ["Theory-Bio"], "email": "aaronson@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/1324"},
{"website": "http://www.sls.csail.mit.edu/sls/people/zue.shtml", "bio": "\nVictor Zue is the Delta Electronics Professor of Electrical        Engineering and Computer Science at MIT. In the early part of his        career, Victor conducted research in acoustic phonetics and        phonology, codifying the acoustic manifestation of speech sounds in  American English. Subsequently, his research interest shifted to the  development of spoken language interfaces to make human-computer  interactions easier and more natural. Between 1989 and 2001, he headed  the Spoken Language Systems Group at the MIT Laboratory for Computer  Science, which has pioneered the development of many systems that enable  a user to interact with computers using spoken language. After a  ten-year tenure serving  as Director of the Lab for Computer Science  (LCS), and the       Co-Director and Director of the Computer Science  and Artificial       Intelligence Lab (CSAIL), Victor has returned to  teaching and       research in 2011. His current research interests are  in the area of applying human language technologies to enable easy  access of       structured and unstructured information from the web,  especially in online education.  <br> <br> \r\nVictor is a Fellow of the Acoustical Society of America, and a        Fellow of the International Speech Communication Association. He is also  a member of the U.S. National Academy of Engineering, and an  Academician of the Academia Sinica in Taiwan. He received the Okawa  Prize in 2012, and the IEEE James L. Flanagan Speech and Audio  Processing Award in 2013.\n        ", "name": "Victor Zue", "title": "Professor", "phone": "+1 (617) 253-8513", "publications": ["Zue, V. \"The Use of Speech Knowledge in Speech Recognition,\"   Invited paper, Special issue on Man-Machine Communication, Proc. IEEE,   vol. 73, no. 11, pp. 1602-1615, November 1985 (Also appears in Readings   in Speech Recognition, (Eds.) Waibel and K. Lee, Morgan Kaufmann   Publishers, 1990).", "Zue, V., et al. \"JUPITER: A Telephone-Based Conversational   Interface for Weather Information,\" to appear in IEEE Transactions on   Speech and Audio Processing, Vol. 8, No. 1, January 2000.", "Zue, V. and J. Glass \"Conversational Interfaces: Advances and   Challenges,\" Invited Paper, Special issue on Spoken Language Processing,   Proc. IEEE, vol. 88, no. 8, pp. 1166-1180, August 2000.", "Zue, V. \"On Organic Interfaces,\" Keynote Paper, Proceedings of Interspeech, Antwerp, Belgium, August 2007."], "study_areas": ["Language & Learning"], "email": "zue@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/1522"},
{"website": "http://people.csail.mit.edu/people/phw/phw.html", "bio": "\n <p>Patrick H. Winston is Ford Professor of Artificial Intelligence and Computer Science at the Massachusetts Institute of Technology. He has been with CSAIL and before that the MIT Artificial Intelligence Laboratory since 1967. He joined the faculty in 1970, and he was the Director of the Artificial Intelligence Laboratory from 1972 to 1997.</p> \r\n\r\n <p>Professor Winston is particularly involved in the study of how vision, language, and motor faculties account for intelligence. He also works on applications of Artificial Intelligence that are enabled by learning, precedent-based reasoning, and common-sense problem solving.</p> \r\n\r\n <p>Professor Winston is chairman and cofounder of Ascent Technology, Inc., a company that produces sophisticated scheduling, resource allocation, and schedule recovery applications, enabled by AI technology, and in use throughout the world in major airports and the Department of Defense.</p> \r\n\r\n <p>Professor Winston was a member of the Naval Research Advisory Committee (NRAC) (1985-1990, 1994-2000) for which he served as Chair from 1997 to 2000. During his service on NRAC, he chaired several studies, including a study of how the Navy can best exploit the next generation of computer resources and a study of technology for reduced manning. Professor Winston is also a past president of the American Association for Artificial Intelligence.</p> \r\n\r\n <p>Professor Winston is working on a major new research and educational effort, the Human Intelligence Enterprise, which will bring together and focus research from several fields, including Computer Science, Systems Neuroscience, Cognitive Science, and Linguistics. </p> \n        ", "name": "Patrick Winston", "title": "Professor", "phone": "+1 (617) 253-6754", "publications": [], "study_areas": ["Artificial Intelligence"], "email": "phw@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/804"},
{"website": "http://people.csail.mit.edu/torralba", "bio": "\nAntonio Torralba is an Assistant Professor of Electrical Engineering and Computer Science and a member of the Computer Science and Artificial Intelligence Lab. He is a Telecommunication Engineer by the Technical University of Catalonia (Spain) since 1995. He received his Ph.D. from Grenoble Institute of Technology (France) in 2000. His research interests span computer and human vision, computer graphics and machine learning. His particular areas of interest include object and scene recognition, large image databases, applied machine learning, and the role of context in visual perception.\n        ", "name": "Antonio Torralba", "title": "Professor", "phone": "+1 (617) 324-0900", "publications": [], "study_areas": ["Vision & Graphics"], "email": "torralba@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/793"},
{"website": "http://www.swiss.csail.mit.edu/~hal/hal.html", "bio": "\nSee  <a href=\"http://www.swiss.csail.mit.edu/~hal/hal.html\">personal web site</a> <br>", "name": "Hal Abelson", "title": "Professor", "phone": "+1 (617) 253-5856", "publications": ["Association for Computing Machinery: Karl V. Karlstrom Outstanding Educator Award (2012)", "ACM Special Interest Group on Computer Science Education: Outstanding Contributions to Computer Science Education (2011)", "Phi Beta Kappa: Visiting Scholar (2003)", "Institute of Electrical and Electronics Engineers: Fellow (1995)", "Institute of Electrical and Electronics Engineers: Taylor L. Booth Award (1995)", "MIT EECS: Adler Scholar (1993)", "MIT EECS: Junior Bose Teaching Award (1992)", "MIT EECS: MacVicar Faculty Fellow (1992)"], "study_areas": ["Classic AI-Bio"], "email": "hal@mit.edu", "profile_link": "http://www.csail.mit.edu/user/1535"},
{"website": "http://people.csail.mit.edu/fredo/", "bio": "\n <p>Fredo Durand is a professor in the Electrical Engineering and Computer Science Department of the Massachusetts Institute of Technology, and a member of the Computer Science and Artificial Intelligence Laboratory. He received his PhD from Grenoble University (France) in 1999. He worked with Claude Puech and George Drettakis on both theoretical and practical aspects of 3D visibility. From 1999 till 2002, he was a post-doctoral researcher in the MIT Computer Graphics Group with Julie Dorsey, where he is now an associate professor.</p> \r\n\r\n <p>His research interests span most aspects of picture generation and creation. This includes realistic graphics, real-time rendering, non-photorealistic rendering, as well as computational photography. His recent emphasis is on the use of tools from signal processing and inspiration from perceptual sciences. He received an inaugural Eurographics Young Researcher Award in 2004, an NSF CAREER award in 2005, an inaugural Microsoft Research New Faculty Fellowship in 2005 and a Sloan fellowship in 2006. </p> \r\n\n        ", "name": "Fredo Durand", "title": "Professor", "phone": "+1 (617) 253-7223", "publications": ["Association for Computing Machinery: NVIDIA Best Paper Presentation (2011)", "Sloan Foundation: Research Fellowship (2006)", "National Science Foundation: Career Award (2005)", "Microsoft Research: New Faculty Fellowship Award (2005)", "Eurographics: The Young Researcher Award (2004)"], "study_areas": ["Vision & Graphics", "computational photography"], "email": "fredo@graphics.csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/1091"},
{"website": "http://mit.edu/tidor", "bio": "\nOur research is focused on the analysis of complex biological systems at both the molecular level and the systems level. Our molecular work concentrates on the structure and properties of proteins, nucleic acids, and their complexes. Investigations probe the sources of stability and specificity that drive folding and binding events of macromolecules. Studies are aimed at dissecting the interactions responsible for the specific structure of folded proteins and the binding geometry of molecular complexes. The roles played by salt bridges, hydrogen bonds, side-chain packing, rotameric states, solvation, and the hydrophobic effect in native biomolecules are being explored, and strategies for re-casting these roles through structure-based molecular design are being developed. Our work at the systems level involves the construction and analysis of correlated patterns of gene expression and their relation to biochemical regulatory networks and signal transduction pathways in cells. Much of this work is motivated by the enormous advances in genome science and in the availability of parallel arrays of gene expression data. The methods of theoretical and computational biophysics and approaches from artificial intelligence, applied mathematics, and chemical engineering play key roles in our work.\n        ", "name": "Bruce Tidor", "title": "Professor", "phone": "+1 (617) 253-7258", "publications": ["American Association for the Advancement of Science: Fellow (2009)", "Sloan Foundation: Research Fellowship (1999)"], "study_areas": ["Classic AI-Bio"], "email": "tidor@mit.edu", "profile_link": "http://www.csail.mit.edu/user/801"},
{"website": "http://people.csail.mit.edu/people/davis/", "bio": "\n <p>Randall Davis received an AB from Dartmouth (summa cum laude, Phi Beta Kappa) in 1970 and a PhD from Stanford in artificial intelligence in 1976. He joined the EECS Department in 1978, and from 1979-1981 held an Esther and Harold Edgerton Endowed Chair. He served for 5 years as Associate Director of the Artificial Intelligence Laboratory, and is currently a Professor in the Department and a Research Director of CSAIL</p> \r\n\r\n <p>He has been one of the seminal contributors to the field of knowledge-based systems, publishing more than 50 articles and playing a central role in the development of several systems. His current research involves developing advanced tools that permit natural, sketch-based interaction with software, particularly for computer-aided design and design rationale capture.</p> \r\n\r\n <p>He has also been active in the area of intellectual property and software. In 1990 he served as expert to the Court in Computer Associates v. Altai, a case that produced the abstraction, filtration, comparison test for software copyright. He served on the panel run by the Computer Science and Telecommunications Board (CSTB) of the National Academy of Science in 1991 that resulted in Intellectual Property Issues in Software. A 1994 paper in the Columbia Law Review analyzed the difficulties in applying intellectual property law to software and proposed a number of remedies.</p> \r\n\r\n <p>He has served as an expert in a variety of cases involving software, including the investigation by the Department of Justice of the Inslaw matter, where he investigated allegations of copyright theft and cover-up by the Federal Bureau of Investigation, the National Security Agency, the Drug Enforcement Agency, the United States Customs Service, and the Defense Intelligence Agency. From 1998-2000 he served as the chairman of the National Academy of Sciences study on intellectual property rights and the information infrastructure entitled The Digital Dilemma: Intellectual Property in the Information Age, published by the National Academy Press in February, 2000. </p> \n        ", "name": "Randall Davis", "title": "Professor", "phone": "+1 (617) 253-5879", "publications": ["Christine Alvarado and Randall Davis. Dynamically Constructed Bayes Nets for Multi-Domain Sketch Understanding. In Proceedings of IJCAI-05, pp.1407-1412. San Francisco, California, August 1 2005.", "Tevfik Metin Sezgin and Randall Davis. HMM-Based Efficient Sketch Recognition. In Proceedings of the International Conference on Intelligent User Interfaces (IUI'05), pp.281-283. New York, New York, January 9-12 2005.", "Adler, Aaron and Davis, Randall (2004). Speech and sketching for multimodal design. Proceedings of IUI 2004, pp. 214-216.", "Veselova, Olya and Davis, Randall (2004). Perceptually Based Learning of Shape Descriptions for Sketch Recognition. (AAAI-04), July 2004", "Hammond, Tracy and Davis, Randall (2004). Automatically Transforming Symbolic Shape Descriptions for Use in Sketch Recognition. (AAAI-04), July 2004", "Alvarado, Christine and Davis, Randall (2002). A Framework for Multi-Domain Sketch Recognition. 2002 AAAI Spring Symposium on Sketch Understanding. pp 1-8", "Alvarado, Christine and Davis, Randall (2001). Resolving ambiguities to create a natural sketch based interface. Proceedings of IJCAI-2001, August 2001. pp 1365 - 1371", "Oltmans, Michael and Davis, Randall (2001). Naturally Conveyed Explanations of Device Behavior. Proceedings of PUI-2001, November 2001. [PS], [PDF]", "Davis R, Shrobe H, Szolovits P, â€œWhat is a Knowledge Representation,\" AI Magazine, 14, #1, Spring 1993, pp. 17-33.", "Davis R, â€œA Tale of Two Knowledge Servers,\" AI Magazine,12:3, Fall 1991, pp. 118-120.", "Davis R, and Lenat D B, Knowledge-based Systems in Artificial Intelligence, McGraw-Hill, 1982."], "study_areas": ["AI", "HCI"], "email": "davis@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/805"},
{"website": "http://people.csail.mit.edu/~brooks", "bio": "\nRodney A. Brooks is the Panasonic Professor of Robotics at MIT. He is also co-founder and Chief Technical Officer of iRobot Corp (nasdaq: IRBT). From 1997 - 2003 and from 2003 - 2007 he was, respectively, Director of the Artificial Intelligence Lab and of the Computer Science & Artificial Intelligence Lab. He received degrees in pure mathematics from the Flinders University of South Australia and the Ph.D. in Computer Science from Stanford University in 1981. He held research positions at Carnegie Mellon University and MIT, and a faculty position at Stanford before joining the faculty of MIT in 1984. His research is concerned with both the engineering of intelligent robots to operate in unstructured environments, and with understanding human intelligence through building humanoid robots. He has published papers and books in model-based computer vision, path planning, uncertainty analysis, robot assembly, active vision, autonomous robots, micro-robots, micro-actuators, planetary exploration, representation, artificial life, humanoid robots, and compiler design. Dr. Brooks is a Member of the National Academy of Engineering (NAE), a Founding Fellow of the Association for the Advancement of Artificial Intelligence (AAAI), a Fellow of the American Academy of Arts & Sciences (AAAS), a Fellow of the American Association for the Advancement of Science (the other AAAS), a Fellow of the Association for Computing Machinery (ACM), a Foreign Fellow of The Australian Academy of Technological Sciences and Engineering (ATSE), and a Corresponding Member of the Australian Academy of Science (AAS). He won the Computers and Thought Award at the 1991 IJCAI (International Joint Conference on Artificial Intelligence). He has been the Cray lecturer at the University of Minnesota, the Mellon lecturer at Dartmouth College, and the Forsythe lecturer at Stanford University. He was co-founding editor of the International Journal of Computer Vision and is a member of the editorial boards of various journals including Adaptive Behavior, Artificial Life, Applied Artificial Intelligence, Autonomous Robots, the International Journal of Humanoid Research, and New Generation Computing. He starred as himself in the 1997 Errol Morris movie \"Fast, Cheap and Out of Control\"; named for one of his scientific papers, a Sony Classics picture, now available on DVD.\n        ", "name": "Rodney Brooks", "title": "Professor Emeritus", "phone": "", "publications": ["\"Robotics Research: Results of the 12th International Symposium ISRR,\" with Thrun, S. and H. Durrant-Whyte, Eds. (Springer Tracts in Advanced Robotics, 2007)", "\"Cambrian Intelligence,\" (MIT Press, 1999)", "\"The Relationship Between Matter and Life\" (in Nature 409, pp. 409-411; 2001)", "\"Flesh and Machines,\" (Pantheon, 2002)"], "study_areas": ["Robotics"], "email": "brooks@csail.mit.edu", "profile_link": "http://www.csail.mit.edu/user/818"}]