[{"website": "http://hips.seas.harvard.edu/", "bio": "In July 2011 Ryan P. Adams was appointed as an Assistant Professor of Computer Science at the Harvard John A. Paulson School of Engineering and Applied Sciences. Previously, he was a   Junior Research Fellow at the University of Toronto. His research focuses on machine learning and computational statistics, but he is broadly interested in questions related to artificial intelligence, computational neuroscience, machine vision, and Bayesian nonparametrics. Adams leads the HIPS (Harvard Intelligent Probabilistic Systems) group, dedicated to building intelligent algorithms. What makes a system intelligent? The HIPS philosophy is that \"intelligence\" means making decisions under uncertainty, adapting to experience, and discovering structure in high-dimensional noisy data. The unifying theme for research in these areas is developing new approaches to statistical inference: uncovering the coherent structure that we cannot directly observe and using it for exploration and to make decisions or predictions. Ryan and his team develop new models for data, new tools for performing inference, and new computational structures for representing knowledge and uncertainty.", "name": "Ryan P. Adams", "title": "Assistant Professor of Computer Science", "phone": "(617) 495-3311", "address": "327 Maxwell Dworkin", "study_areas": ["Artificial Intelligence (Computational Linguistics, Machine Learning, Multi-agent Systems, Robotics)", "Computational and Data Science (High Performance Computing, Connectomics, Large-scale Data Management)", "Computational Neuroscience"], "email": "rpa@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/rpa"},
{"website": "http://cyber.law.harvard.edu/people/jzittrain", "bio": "Jonathan Zittrain is a Professor at the Harvard Law School, the Harvard Kennedy School of Government and the Harvard John A. Paulson School of Engineering and Applied Sciences. He is a co-founder of the Berkman Center for Internet & Society and  a member of the Board of Trustees of the Internet Society and is on the board of advisors for Scientific American. Previously, he was Professor of Internet Governance and Regulation at Oxford University. He is a member of the Council on Foreign Relations and a Forum Fellow of the World Economic Forum, which has named him a Young Global Leader. His research interests include battles for control of digital property and content, cryptography, electronic privacy, the roles of intermediaries within Internet architecture, and the useful and unobtrusive deployment of technology in education. His book, The Future of the Internet -- And How to Stop It,  focuses on the future of the now-intertwined Internet and PC, and he has co-edited two studies of Internet filtering by national governments, including Access Denied: The Practice and Policy of Global Internet Filtering.", "name": "Jonathan Zittrain", "title": "Professor of Computer Science (SEAS); George Bemis Professor of Law (Harvard Law School); Professor (Harvard Kennedy School)", "phone": "(617) 495-4643", "address": "", "study_areas": ["Information and Society (Policy, Computer Science Education, Privacy and Security)", "Communications and Internet Policy", "Science and Technology Policy"], "email": "a2jz@law.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/zittrain"},
{"website": "http://people.seas.harvard.edu/~valiant", "bio": "Computer science encompasses the study of both artificial as well as natural phenomena. The former concern artificially created devices such as computers. The latter relate to the many step-by-step, or computational, processes found in nature such as in the brain or in the course of biological evolution. In most areas, whether natural or artificial, the ultimate limitations of such processes are as yet not well understood. The potential of computing devices may be currently far from being fully realized, while fundamental quantitative questions in neuroscience and evolution remain unanswered. Professor Valiant's current research focuses on a number of such basic questions. The majority of computational problems, including those with explicit mathematical characterizations such as the NP-complete problems, fall within the category of those for which the question of how best to compute them is little understood. These core problems of complexity theory remain the most fundamental mathematical challenges of computer science. They are related to foundational questions in quantum physics, most notably through polynomial time versions of the Turing hypothesis. Professor Valiant has proposed algebraic formulations of these questions, and is currently pursuing the holographic approach. In computer systems major conceptual challenges remain in controlling, load-balancing and programming large parallel systems, whether they be multicore devices on a chip or highly distributed systems. Professor Valiant's most recent interest in this area concerns the problem of how to design algorithms for multi-core devices that are portable, and run efficiently on wide classes of architectural designs with widely varying performance characteristics. A fundamental question for artificial intelligence is to characterize the computational building blocks that are necessary for cognition. A specific challenge is to build on the success of machine learning so as to cover broader issues in intelligence. This requires, in particular a reconciliation between two contradictory characteristics--the apparent logical nature of reasoning and the statistical nature of learning. Professor Valiant has developed a formal system, called robust logics, that aims to achieve  such a reconciliation. In neuroscience a widely open problem remains how the weak model of computation that cortex apparently offers can support cognitive computation at all. Professor Valiant has been working on showing how broad sets of primitive operations can be computed robustly and on a significant scale even on such a weak model. A challenge in a different direction is understanding how Darwinian evolution can evolve complex mechanisms in the numbers of generations and with population sizes that have apparently been available on earth. Darwin's notions of variation and selection are computational notions and offer a very direct challenge for quantitative analysis by the methods of computer science. What is sought is a quantitative understanding of the possibilities and limitations of the basic Darwinian process. ", "name": "Leslie Valiant", "title": "T. Jefferson Coolidge Professor of Computer Science and Applied Mathematics", "phone": "(617) 495-5817", "address": "351 Maxwell Dworkin Building", "study_areas": ["Theory of Computation", "Computational Neuroscience"], "email": "valiant@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/valiant"},
{"website": "http://www.eecs.harvard.edu/~waldo/", "bio": " John A. Paulson Jim has designed clouds at VMware, and was a Distinguished Engineer with Sun Microsystems Laboratories, where he investigated next-generation large-scale distributed systems. His last project at Sun Labs was Darkstar. Prior to (re)joining Sun Labs, he was the lead architect for Jini, a distributed programming system based on Java. While at Sun, Jim did research and product development in the areas of on-line games and virtual worlds, medical sensing, object-oriented programming and systems, distributed computing, and user environments. He was also involved in some of the early design and development of the Java programming language and environment. Before joining Sun, Jim spent eight years at Apollo Computer and Hewlett Packard working in the areas of distributed object systems, user interfaces, class libraries, text and internationalization. While at HP, he led the design and development of the first Object Request Broker, and was instrumental in getting that technology incorporated into the first OMG CORBA specification. Jim edited the book   (MIT Press), co-edited   (National Academies Press), and was one of the authors of   (Addison Wesley). More recently, he authored  . He is currently a member of the editorial boards of   and  . He also holds over 50 patents. He is currently a member of the editorial boards of   and  . He also holds over 50 patents. Jim received his Ph.D. in philosophy from the University of Massachusetts (Amherst). He also holds M.A. degrees in both linguistics and philosophy from the University of Utah.", "name": "James H. Waldo", "title": "Gordon McKay Professor of the Practice of Computer Science", "phone": "(617) 496-5661", "address": "127 Maxwell Dworkin", "study_areas": ["Computational and Data Science (High Performance Computing, Connectomics, Large-scale Data Management)", "Information and Society (Policy, Computer Science Education, Privacy and Security)", "Systems, Networks and Databases (Operating Systems, Distributed Systems, Database Management Systems)"], "email": "waldo@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/waldo"},
{"website": "http://people.seas.harvard.edu/~salil/", "bio": "Salil Vadhan's research centers around the interface between computational complexity theory and cryptography. Complexity theory studies the power and limitations of efficient computation, and cryptography aims to design protocols that withstand adversarial behavior. Within these general areas, Vadhan has focused on the topics of pseudorandomness, the theory of efficiently generating objects that \"look random\" despite being constructed with little or no randomness, and zero-knowledge proofs, which are interactive proofs that are convincing yet reveal nothing other than the validity of the assertion being proven. One of Vadhan's contributions in the area of pseudorandomness was the discovery (with Reingold and Wigderson) of the zig-zag graph product for constructing expander graphs , which has been used in or inspired the solution of several long-standing open questions in theoretical computer science. In the area of zero-knowledge proofs, Vadhan's work began with his Ph.D. thesis (MIT, 1999), which provided a comprehensive complexity-theoretic understanding of a subclass of zero-knowledge proofs known as statistical zero-knowledge proofs. In the last few years, Vadhan and his students have returned to this topic, and have extended this complexity-theoretic study to include the most general notions of zero knowledge. As a result, they have managed to reduce or eliminate the complexity assumptions used in many fundamental results about zero-knowledge proofs.", "name": "Salil P. Vadhan", "title": "Vicky Joseph Professor of Computer Science and Applied Mathematics", "phone": "(617) 496-0439", "address": "337 Maxwell Dworkin", "study_areas": ["Theory of Computation", "Information and Society (Policy, Computer Science Education, Privacy and Security)"], "email": "salil@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/salil"},
{"website": "http://people.seas.harvard.edu/~yaron/", "bio": "Assistant Professor of Computer Science Yaron Singer joined the SEAS faculty in 2013, after doing postdoctoral research at Google. He was also a Microsoft Research Fellow as well as a Facebook Fellow. Singer focuses on problems and issues at the intersection of economics and computer science. With David Parkes and Yiling Chen, Singer helped organize the EconCS Seminar at SEAS.  His research interests include algorithms, mechanisms, and data-mining techniques that guide the design of systems powered by social interactions and data.", "name": "Yaron Singer", "title": "Assistant Professor of Computer Science", "phone": "(617) 496-9271", "address": "239 Maxwell Dworkin", "study_areas": ["Economics and Computation", "Theory of Computation", "Economics and Computation"], "email": "yaron@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/yaron"},
{"website": "http://www.eecs.harvard.edu/~smith/", "bio": "Mike Smith’s leadership of Harvard’s Faculty of Arts and Sciences has been characterized by a deep commitment to undergraduate teaching, to a tenure-track system, and to research, both fundamental and applied. Since the start of his deanship in July 2007, he has emphasized robust academic planning and priority setting, which has fundamentally changed the way the FAS allocates its resources and prepares the Faculty to meet future challenges and opportunities. This shift has allowed the FAS to maintain the unparalleled excellence of its programs, while weathering the worst financial downturn since the Great Depression. A member of the Faculty since 1992, Smith is known for his innovative work on computing systems, particularly on issues involving a detailed knowledge of both the hardware and software in these sophisticated systems. Smith’s research interests include dynamic optimization, machine-specific and profile-driven compilation, high-performance computer architecture, and practical applications of security. He is also a leading figure in a range of interdisciplinary activities that explore the interplay of technology with other fields, from the life sciences to economics to philosophy to law. In 2001, Smith co-founded the data security company Liquid Machines Inc., whose enterprise rights management products gave companies the ability to easily control and manage access to valuable documents and other digital assets. In June 2010, Liquid Machines was acquired by Check Point Software Technologies Ltd., an Israeli Internet and data security company best known for its ZoneAlarm firewall software. Smith received a B.S. in electrical engineering and computer science from Princeton University in 1983, an M.S. in electrical engineering from Worcester Polytechnic Institute in 1985, and a Ph.D. in electrical engineering from Stanford University in 1993. He began at Harvard in 1992 as an instructor and rose through the tenure-track ranks. In 1994 he received a prestigious National Science Foundation Young Investigator Award, and in 1999 the Alpha Iota Prize for Excellence in Teaching.", "name": "Michael D. Smith", "title": "Edgerley Family Dean of the Faculty of Arts and Sciences; John H. Finley, Jr. Professor of Engineering and Applied Sciences", "phone": "(617) 495-1566", "address": "2nd Floor University Hall", "study_areas": ["Programming Languages (Foundations, Design and Application, Implementation)", "Systems, Networks and Databases (Operating Systems, Distributed Systems, Database Management Systems)", "Computer Engineering and Architecture"], "email": "mike.smith@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/mikesmith"},
{"website": "http://rush.seas.harvard.edu", "bio": "", "name": "Alexander Sasha Rush", "title": "Assistant Professor of Computer Science", "phone": "", "address": "217 Maxwell Dworkin", "study_areas": ["Artificial Intelligence (Computational Linguistics, Machine Learning, Multi-agent Systems, Robotics)", "Computational and Data Science (High Performance Computing, Connectomics, Large-scale Data Management)"], "email": "srush@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/srush"},
{"website": "http://www.eecs.harvard.edu/~shieber/", "bio": " is a computer scientist whose primary research area is  , the study of   from the standpoint of computer science. Research in the field pursues both scientific and engineering goals, undergirded by foundational formal and mathematical tools. Professor Shieber works on all of these aspects of the field. How natural languages are structured to permit efficient communication is a difficult and multi-faceted question, involving issues in linguistics (the syntactic and semantic structure of natural languages), theoretical computer science (the inherent complexity of aspects of human language); computer systems (in connection with the design and deployment of algorithms for natural-language analysis and generation); psychology (human sentence processing and misprocessing); and artificial intelligence (the encoding of general knowledge and its application to the understanding of utterances). To answer such difficult questions, Shieber synthesizes knowledge from several of these fields. In work on the computational properties of grammar formalisms — formal metalanguages for specifying the syntactic and semantic structure of natural languages — he uses techniques from theoretical computer science to analyze the expressivity and computational effectiveness of the formalisms, and builds on algorithms from the field of computer systems. (Such studies can shed light on computer languages as well as natural languages. For example, they reveal some deep similarities between the grammar formalisms proposed for natural languages and the static semantics of programming languages.) In his research on psycholinguistics, a simpler model of   was developed by applying technology from the efficient parsing of programming languages. Similarly, his research on semantics has made use of the technology of higher-order logic to explicate   of natural language. His current research on   for describing the relations between languages has application in a variety of natural-language-processing areas, such as   and  . Beyond computational linguistics, Professor Shieber has attacked problems in a wide range of other areas as well, including such varied topics as The range of topics is indicated in the  .", "name": "Stuart M. Shieber", "title": "James O. Welch, Jr. and Virginia B. Welch Professor of Computer Science", "phone": "(617) 495-2344", "address": "245 Maxwell Dworkin Building", "study_areas": ["Artificial Intelligence (Computational Linguistics, Machine Learning, Multi-agent Systems, Robotics)"], "email": "shieber@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/shieber"},
{"website": "http://www.eecs.harvard.edu/~parkes/", "bio": "The Internet embodies a new paradigm of distributed open computer networks, in which entities--users and computational devices--are not cooperative, but self-interested, with private information and goals. Computational mechanism design is the problem of designing the incentives within a system, or the \"rules of the game,\" to compute optimal solutions to distributed optimization problems despite this self-interest. An emerging area in both artificial intelligence and theoretical computer science, computational mechanism design lies at the interface of computer science, game theory, and economics. Limited and/or costly computation, both at the network and at the level of distributed computational agents, coupled with the inherent combinatorial complexity of many interesting problem domains (e.g. those in scheduling and resource allocation) quickly break naive implementations of classic game-theoretic mechanisms. In computational mechanism design we resolve these computational problems, while seeking to retain useful economic and game-theoretic properties. Electronic commerce presents a rich application domain, for example to support automated negotiation across and within groups of individuals and businesses. There are many other applications, for example to network routing and multi-cast problems, and to distributed scheduling problems.", "name": "David C. Parkes", "title": "George F. Colony Professor of Computer Science; Harvard College Professor", "phone": "(617) 384-8130", "address": "229 Maxwell Dworkin", "study_areas": ["Economics and Computation", "Artificial Intelligence (Computational Linguistics, Machine Learning, Multi-agent Systems, Robotics)", "Economics and Computation"], "email": "parkes@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/parkes"},
{"website": "http://www.eecs.harvard.edu/~margo/", "bio": "Margo I. Seltzer is the Herchel Smith Professor of Computer Science in the Harvard John A. Paulson School of Engineering and Applied Sciences. She received an A.B. degree in Applied Mathematics from Harvard/Radcliffe College in 1983 and a Ph. D. in Computer Science from the University of California, Berkeley, in 1992. She is the author of several widely-used software packages including database and transaction libraries and the 4.4BSD log-structured file system. Dr. Seltzer was a founder and CTO of Sleepycat Software, the makers of Berkeley DB and is now an Architect for Oracle Corporation. Before pursuing an academic career, professor Seltzer spent several years working at startup companies designing and implementing file systems and transaction processing software and designing microprocessors. She is a Sloan Foundation Fellow in Computer Science, a Bunting Fellow, and was the recipient of the 1996 Radcliffe Junior Faculty Fellowship, and the University of California Microelectronics Scholarship. She is recognized as an outstanding teacher and won the Phi Beta Kappa teaching award in 1996 and the Abrahmson Teaching Award in 1999. Professor Seltzer's research focuses on how to make computer systems better for users. Better can mean faster, more reliable, or easier to use. It can also mean that the pieces of a system, its storage, operating system and applications, work together more gracefully. Her research activities range from designing and building new storage systems to building new operating sytems (e.g., VINO) to developing systems for collecting and tracking provenance of digital data. Professor Seltzer and her colleagues in systems form the Systems Research Group at Harvard. For more detailed information on current projects and activities, consult the SYRAH website. ", "name": "Margo I. Seltzer", "title": "Herchel Smith Professor of Computer Science", "phone": "(617) 496-5663", "address": "241 Maxwell Dworkin", "study_areas": ["Computational and Data Science (High Performance Computing, Connectomics, Large-scale Data Management)", "Information and Society (Policy, Computer Science Education, Privacy and Security)", "Systems, Networks and Databases (Operating Systems, Distributed Systems, Database Management Systems)"], "email": "seltzer@g.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/margo"},
{"website": "", "bio": "Michael Rabin, the Thomas J. Watson, Sr. Research Professor of Computer Science, has won every major prize in computer science and continues to contribute actively to major problems of encryption, privacy, and Internet security. In 1935, as a young boy, Rabin left Nazi Germany with his family and settled in Palestine. He showed extraordinary promise in mathematics. In the mid-1950s, he went on to study—and later shape—the fledgling field of theoretical computer science. Rabin joined the Harvard faculty in 1981, when SEAS was still known as the Division of Applied Sciences.. Shortly after he completed his PhD, IBM invited him to a research workshop in Westchester County, N.Y. There he and Dana Scott collaborated on “Finite Automata and Their Decision Problems,” which was published in 1959. In 1976, the authors were honored with a Turing Award for their path-breaking work.  In 1960, Rabin published a second groundbreaking paper, “Degree of Difficulty of Computing a Function and a Partial Ordering of Recursive Sets,” which provided the foundation for subsequent advances in cryptography and the theoretical study of computational complexity. His work has emphasized nondeterministic and probabilistic processes. Many of his later, more applied projects reflect an underlying theme of adding randomness to algorithms, for example, in encryption methods, the prevention of Internet piracy and insuring anonymity and security in online auctions.", "name": "Michael O. Rabin", "title": "Thomas J. Watson, Sr. Research Professor of Computer Science", "phone": "(617) 496-6294", "address": "349 Maxwell Dworkin Building", "study_areas": ["Theory of Computation"], "email": "rabin@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/rabin"},
{"website": "", "bio": "Madhu Sudan got his Bachelors degree from IIT Delhi in 1987 and his Ph.D. from U.C. Berkeley in 1992. Between 1992 and 2015, Madhu Sudan spent time at IBM Research (Research Staff Member 1992-1997), at MIT (Associate Professor 1997-2000, Professor 2000-2011, Fujitsu Chair Professor 2003-2011, CSAIL Associate Director 2007-2009, Adjunct Professor 2011-2015), and at Microsoft Research (Principal Researcher, 2009-2015). \nHe has been at Harvard since October 2015. Madhu Sudan's research interests revolve around theoretical studies of communication and computation. Specifically his research focusses on concepts of reliability and mechanisms that are, or can be, used by computers to interact reliably with each other. His research draws on tools from computational complexity, which studies efficiency of computation, and many areas of mathematics including algebra and probability theory.  He is best known for his works on probabilistic checking of proofs, and on the design of list-decoding algorithms for error-correcting codes.  In 2002, Madhu Sudan was awarded the Nevanlinna Prize, for outstanding contributions to the mathematics of computer science, at the International Congress of Mathematicians in Beijing. He is also the recipient of the 2014 Infosys Foundation Prize in Mathematical Sciences. Madhu Sudan is a fellow of the ACM, the IEEE, the AMS and the American Academy of Arts and Sciences. He was a Radcliffe Fellow from 2003-2004.", "name": "Madhu Sudan", "title": "Gordon McKay Professor of Computer Science", "phone": "", "address": "", "study_areas": ["Theory of Computation", "Theory of Communication"], "email": "madhu@cs.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/madhusudan"},
{"website": "http://gvi.seas.harvard.edu/pfister", "bio": "", "name": "Hanspeter Pfister", "title": "An Wang Professor of Computer Science", "phone": "(617) 496-8269", "address": "227 Maxwell Dworkin", "study_areas": ["Computational and Data Science (High Performance Computing, Connectomics, Large-scale Data Management)", "Graphics, Vision and Interaction (Human-Computer Interaction, Computer Graphics, Scientific and Information Visualization, Computer Vision)"], "email": "pfister@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/pfister"},
{"website": "http://people.seas.harvard.edu/~minilek/", "bio": "Jelani Nelson, an assistant professor of computer science, joined SEAS in 2013. His research focuses on the development of efficient algorithms for massive datasets, especially algorithms that use little memory and require only a single or few passes over the data (so-called “streaming algorithms”).  Using a technique called \"sketching,\" it is possible to create a very compressed version of a dataset that lacks all the detail but provides sufficient information to answer certain queries. Sometimes, these sketches can be exponentially smaller than the original dataset, allowing savings in processing time, communications bandwidth, and required storage capacity. The algorithms that produce these sketches, however, must be carefully designed to guarantee an adequate degree of accuracy. In 2014 Nelson received a National Science Foundation Faculty Early Career Development (CAREER) Award. And during 2012−13 he was a member of the Institute for Advanced Study. He was also a Xerox Fellow and a National Defense Science and Engineering Graduate Fellow.", "name": "Jelani Nelson", "title": "Assistant Professor of Computer Science", "phone": "", "address": "125 Maxwell Dworkin", "study_areas": ["Theory of Computation"], "email": "minilek@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/minilek"},
{"website": "", "bio": "", "name": "James Mickens", "title": "Associate Professor of Computer Science", "phone": "(617) 384-8132", "address": "335 Maxwell Dworkin", "study_areas": ["Information and Society (Policy, Computer Science Education, Privacy and Security)", "Systems, Networks and Databases (Operating Systems, Distributed Systems, Database Management Systems)"], "email": "mickens@g.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/mickens"},
{"website": "http://www.eecs.harvard.edu/~rad/", "bio": "Biological systems, from multicellular organisms to social insects (\"superorganisms\"), get tremendous mileage from the cooperation of vast numbers of cheap, unreliable, and limited individuals. Engineers are increasingly facing a similar challenge: how to effectively engineer systems that are composed of many agents: distributed networks, programmable materials, groups of robots. Nature can provide insights into principles that allow robust collective behavior to emerge; the challenge is formalizing and generalizing these principles to program new kinds of systems.  Nagpal's group is interested in engineering and understanding self-organizing multi-agent systems, where large numbers of simple agents cooperate to produce complex and robust global behavior. This work lies at the intersection of computer science (AI/robotics) and biology. Her group studies bio-inspired algorithms, programming paradigms, and hardware designs for swarm/modular robotic systems and smart materials, drawing inspiration mainly from social insects and multicellular biology. The group also investigates models of self-organization in biology, specifically how cells cooperate during the development of multicellular organisms.  The overall goal is to provide a framework for the design and analysis of self-organizing systems by combining traditional computer science techniques (for managing complexity) with biological models (for robustness at the local level). ", "name": "Radhika Nagpal", "title": "Fred Kavli Professor of Computer Science", "phone": "(617) 496-6434", "address": "235 Maxwell Dworkin", "study_areas": ["Modeling Physical/Biological Phenomena and Systems", "Bioinspired Robotics and Computing", "Artificial Intelligence (Computational Linguistics, Machine Learning, Multi-agent Systems, Robotics)", "Programming Languages (Foundations, Design and Application, Implementation)"], "email": "rad@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/rad"},
{"website": "http://www.eecs.harvard.edu/~michaelm/", "bio": "Professor Mitzenmacher's research focuses on developing randomized algorithms and analyzing random processes, especially for large, distributed computer networks such as the Web. He develops mathematical tools and methods to analyze complex systems and uses them to solve problems that arise in real applications. For example, he has analyzed simple randomized load balancing schemes for distributed systems such as banks of processors used to host Web services. This analysis also applies to new hashing schemes. Hashing is a fundamental method for organizing and accessing data, so his analysis may prove effective for several applications. He is currently working on a paper showing how a new hashing scheme can improve current methods for IP routing (the standard protocol for routing data over the internet). Professor Mitzenmacher has also worked to create new classes of erasure and error-correcting codes. Besides having novel theoretical properties and requiring a sophisticated mathematical analysis, the erasure codes are well-suited for distributing bulk data such as movies or software over the Internet. He has also co-developed the theory of min-wise independence, which provides a mathematical framework for finding syntactically similar documents in a large collection of documents. The theory is applied in search engines to avoid storing multiple approximate copies of a document, reducing storage needs by about 30%. Recently, he has studied random walks on the Web and shown how they can be used to measure the size and quality of search engine indexes.", "name": "Michael D. Mitzenmacher", "title": "Thomas J. Watson, Sr. Professor of Computer Science", "phone": "(617) 496-7172", "address": "331 Maxwell Dworkin", "study_areas": ["Theory of Computation", "Systems, Networks and Databases (Operating Systems, Distributed Systems, Database Management Systems)", "Theory of Communication"], "email": "michaelm@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/michaelm"},
{"website": "http://lewis.seas.harvard.edu", "bio": "Harry Lewis is Gordon McKay Professor of Computer Science in the Harvard John A. Paulson School of Engineering and Applied Sciences. He is the author of six books and numerous articles on various aspects of computer science. Over his more than thirty years of teaching he has helped launch thousands of Harvard undergraduates into careers in computer science. His book about higher education, Excellence Without a Soul: Does Liberal Education Have a Future was a Boston Globe best-seller and the subject of favorable reviews in both the Boston Globe and the Wall Street Journal. It has been translated into Chinese (in both Taiwanese and mainland editions) and Korean. He is coauthor with Hal Abelson and Ken Ledeen of Blown to Bits: Your Life, Liberty, and Happiness After the Digital Explosion (2008), which explains for the general reader the origins and public consequences of the explosion of digital information. From 1995-2003 Lewis served as Dean of Harvard College. In this capacity he oversaw the undergraduate experience, including residential life, career services, public service, academic and personal advising, athletic policy, and intercultural and race relations. He is a long time member of the College’s Admissions Committee. Lewis has worked extensively on the algorithmic solvability of logical, computational, and combinatorial systems, attempting to clarify the relations between them and to identify their common characteristics. He is also actively involved in the use of computers in education, and his books have had a significant influence on the teaching of the foundations of computer science to undergraduates.", "name": "Harry R. Lewis", "title": "Gordon McKay Professor of Computer Science", "phone": "(617) 496-2424", "address": "237 Maxwell Dworkin", "study_areas": ["Theory of Computation", "Information and Society (Policy, Computer Science Education, Privacy and Security)", "Communications and Internet Policy", "Science and Technology Policy"], "email": "lewis@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/lewis"},
{"website": "http://cs.harvard.edu/malan", "bio": "David J. Malan is Gordon McKay Professor of the Practice of Computer Science at the  . He received his A.B., S.M., and Ph.D. in Computer Science from the same in 1999, 2004, and 2007, respectively. He teaches  's second-largest course,  , otherwise known as  , and  's largest course,  . He also teaches at   and  . All of his   are available as OpenCourseWare. Previously, Malan served as Chief Information Officer for Mindset Media. While in graduate school, he worked part-time for the   as a forensic investigator, after which he founded his own startup. On the side, he volunteered as an emergency medical technician (EMT-B) for  . He continues to volunteer as an EMT-B for the  . Malan's   in graduate school focused primarily on cybersecurity and digital forensics. His dissertation was entitled  . His more recent   focus on pedagogy and instructional technologies. Malan's   offers some additional background.", "name": "David J. Malan", "title": "Gordon McKay Professor of the Practice of Computer Science", "phone": "", "address": "", "study_areas": ["Information and Society (Policy, Computer Science Education, Privacy and Security)", "Science and Engineering Education"], "email": "malan@harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/malan"},
{"website": "http://scottk.seas.harvard.edu/", "bio": "", "name": "Scott Kuindersma", "title": "Assistant Professor of Engineering and Computer Science", "phone": "(617) 495-9526", "address": "151 Maxwell Dworkin", "study_areas": ["Control Theory and Stochastic Systems", "Bioinspired Robotics and Computing", "Biomechanics and Motor Control", "Artificial Intelligence (Computational Linguistics, Machine Learning, Multi-agent Systems, Robotics)", "Robotics and Control"], "email": "scottk@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/scottk"},
{"website": "http://www.eecs.harvard.edu/~htk", "bio": "Professor Kung is interested in computer networks as well as their applications in electronic commerce. Prior to joining Harvard in 1992, he taught at Carnegie Mellon, and led research projects on the design and experiment of novel parallel computers and switch-based networks. At Harvard, Professor Kung teaches and researches in computer networks. Since 1999, he has been co-chairing a new joint Ph.D. program with the Harvard Business School on information technology and management. The first student class for this Ph.D. program started in the fall of 2000. To complement his academic activities, Professor Kung maintains a strong link with industry. He has served as a consultant and board member to numerous companies. Professor Kung's professional honors include: Member of the National Academy of Engineering; Member of the Academia Sinica (in Taiwan); and recipient of the Inventor of the Year Award by the Pittsburgh Intellectual Property Law Association in 1991.", "name": "H.T. Kung", "title": "William H. Gates Professor of Computer Science and Electrical Engineering", "phone": "(617) 496-6211", "address": "225 Maxwell Dworkin Building", "study_areas": ["Architecture", "Systems, Networks and Databases (Operating Systems, Distributed Systems, Database Management Systems)", "Computer Engineering and Architecture", "Signal Processing"], "email": "htk@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/htk"},
{"website": "", "bio": "", "name": "Henry H. Leitner", "title": "Senior Lecturer on Computer Science", "phone": "(617) 495-9096", "address": "51 Brattle St, Rm. W725", "study_areas": [], "email": "leitner@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/leitner"},
{"website": "http://grosz.seas.harvard.edu", "bio": "One of the major challenges for computer science in the next decade is to create the scientific and technological base for easy-to-use, large-scale information systems. Better systems for human-computer communication are an essential part of this challenge, and. theories and models of collaboration are needed to provide foundations for constructing systems able to work with each other and with the people using them. Professor Grosz's research group addresses fundamental problems in modeling collaborative activity, developing systems (\"agents\") able to collaborate with each other and their users, and constructing collaborative, multi-modal systems for human-computer communication. Professor Grosz is also attempting to identify the basic structures and processes by which people use natural languages to communicate, focusing in particular on the mechanisms involved in dialogue and spontaneous speech. Professor Grosz's research group uses the SharedPlans model of collaboration in developing intelligent computer \"agents\"; that work together in teams. This model handles arbitrary numbers of agents and multiple levels of action decomposition, and it is comprehensive in its treatment of partiality of belief and intention. The research group is also addressing fundamental questions of coordination and group decision making in the context of group of activity. Professor Grosz has developed a theory of discourse structure that specifies how discourse interpretation depends on interactions among speaker intentions, attentional state, and linguistic form. She has been using the theory to study the use of intonation to convey information about discourse structure, for instance how tones demark, in spoken language, some of the structure that paragraphs and parentheses indicate in written language. This work is likely to lead to better computer speech-synthesis systems. These two strands of research are being combined in an effort (joint with Professor Stuart Shieber) that aims to provide the scientific and technological base for a new paradigm for human-computer interaction, one that would enable the principled design of multi-modal dialogue-supporting interfaces. This research is investigating ways in which a theoretical understanding of collaborative activity can inform in a principled manner the design of concrete software interfaces. Grosz was elected to the National Academy of Engineering in 2008, the American Philosophical Society in 2003, and the American Academy of Arts and Sciences in 2004. She is a fellow of the Association for the Advancement of Artificial Intelligence (AAAI), the Association for Computing Machinery (ACM), and the American Association for the Advancement of Science. For her groundbreaking research that crosses disciplines, she is also the recipient of the ACM/AAAI Allen Newell Award. In 1993, she became the first woman president of the AAAI. She serves on the executive committee and is a former trustee of the International Joint Conferences on Artificial Intelligence and serves on the council of the American Philosophical Society. Grosz earned a bachelor's degree in mathematics from Cornell University and master's and doctoral degrees in computer science from the University of California at Berkeley.", "name": "Barbara J. Grosz", "title": "Higgins Professor of Natural Sciences", "phone": "(617) 495-3673", "address": "249 Maxwell Dworkin Building", "study_areas": ["Artificial Intelligence (Computational Linguistics, Machine Learning, Multi-agent Systems, Robotics)"], "email": "grosz@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/grosz"},
{"website": "http://daslab.seas.harvard.edu", "bio": "Stratos works in the area of data management with emphasis on designing systems for big data exploration. As we continuously increase our ability to collect more and more data, data management and efficient discovery of knowledge become major challenges for both businesses and sciences. Stratos designs big data systems which are tailored for the new challenges posed by the big data era, i.e., systems that (a) are adaptive and easy to use by non experts, requiring minimum tuning and set-up effort and (b) can cope with the ever increasing rates of incoming data and the ever increasing demands for fast reactions to data searches. Stratos leads DASLab, the Data Systems Laboratory @Harvard SEAS and his long term vision is that big data and the hidden knowledge in data that is all around us should be accesible to everyone through easy to use data systems.   ", "name": "Stratos Idreos", "title": "Assistant Professor in Computer Science", "phone": "(617) 495-4316", "address": "139 Maxwell Dworkin", "study_areas": ["Computational and Data Science (High Performance Computing, Connectomics, Large-scale Data Management)", "Systems, Networks and Databases (Operating Systems, Distributed Systems, Database Management Systems)"], "email": "stratos@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/stratos"},
{"website": "http://www.read.seas.harvard.edu/~kohler/", "bio": "Eddie Kohler is Microsoft Professor of Computer Science at the Harvard John A. Paulson School of Engineering and Applied Sciences. He was most recently professor of computer science at   and member of technical staff at  . Previously, he was Chief Scientist at Mazu Networks and held a research appointment at  . His research interests include systems, networks, programming languages, and software engineering.", "name": "Eddie Kohler", "title": "Microsoft Professor of Computer Science", "phone": "(617) 496-2630", "address": "327 Maxwell Dworkin", "study_areas": ["Programming Languages (Foundations, Design and Application, Implementation)", "Systems, Networks and Databases (Operating Systems, Distributed Systems, Database Management Systems)"], "email": "kohler@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/kohler"},
{"website": "http://www.eecs.harvard.edu/~sjg", "bio": "Computer Graphics is an important, fascinating, and very active field in Computer Science that has revolutionized many endeavors in entertainment, design, education, computer human interaction, and medicine. It is a field drawing on algorithm design and system building from the field of computer science, numerical computation from applied mathematics, simulation from applied physics and signal processing from electrical engineering. It is a growing field with one (very competitive) main conference, and a host of very healthy smaller workshops and seminars. In fact, computer graphics forms the single largest special interest subgroup of the Association for Computing Machinery (the primary computer science professional organization). My research has focused on designing fundamental representations for computer graphics, as well as pursuing a mathematically rigorous understanding of computer graphics algorithms and techniques. This theoretical focus has been at the heart of all my research, from my early work in efficient lighting simulation, to my current work on image-based rendering and discrete geometry processing.", "name": "Steven J. Gortler", "title": "Robert I. Goldman Professor of Computer Science", "phone": "(617) 495-3751", "address": "243 Maxwell Dworkin Building", "study_areas": ["Graphics, Vision and Interaction (Human-Computer Interaction, Computer Graphics, Scientific and Information Visualization, Computer Vision)"], "email": "sjg@cs.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/sjg"},
{"website": "http://people.seas.harvard.edu/~chong/", "bio": " John A. Paulson", "name": "Stephen Chong", "title": "Associate Professor of Computer Science", "phone": "(617) 496-6382", "address": "145 Maxwell Dworkin", "study_areas": ["Information and Society (Policy, Computer Science Education, Privacy and Security)", "Programming Languages (Foundations, Design and Application, Implementation)"], "email": "chong@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/chong"},
{"website": "http://finale.seas.harvard.edu/", "bio": "", "name": "Finale Doshi-Velez", "title": "Assistant Professor in Computer Science", "phone": "(617) 496-1228", "address": "219 Maxwell Dworkin", "study_areas": ["Artificial Intelligence (Computational Linguistics, Machine Learning, Multi-agent Systems, Robotics)", "Computational and Data Science (High Performance Computing, Connectomics, Large-scale Data Management)"], "email": "finale@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/finale"},
{"website": "http://www.eecs.harvard.edu/~kgajos/", "bio": "In July of 2009 Gajos joined the Harvard faculty as an assistant professor in Computer Science. His research interests are in human-computer interaction, artificial intelligence and applied machine learning. The phrase \"intelligent interactive systems\" describes many of Gajos's interests: understanding how intelligent technologies can enable novel ways of interacting with computation and in the new challenges that human abilities, limitations and preferences create for machine learning algorithms embedded in interactive systems. In June 2008, he graduated from University of Washington and subsequently joined the   at Microsoft Research for a one year post doc. While at the University of Washington, Gajos built   for automatically generating personalized user interfaces. A short   illustrates how SUPPLE can generate user interfaces adapted to people's motor and vision abilities. In the Fall of 2005, he was visiting faculty at the   in Accra, Ghana, where he taught Introduction to Artificial Intelligence. Before coming to the University of Washington, he spent seven years at MIT where he earned his Bachelors and Masters degrees, and where he also worked for two years as a research scientist managing the operations of the   and coordinating some of the activities related to   at the MIT AI Lab (currently part of  ).", "name": "Krzysztof Gajos", "title": "Associate Professor of Computer Science", "phone": "(617) 496-1876", "address": "251 Maxwell Dworkin", "study_areas": ["Artificial Intelligence (Computational Linguistics, Machine Learning, Multi-agent Systems, Robotics)", "Graphics, Vision and Interaction (Human-Computer Interaction, Computer Graphics, Scientific and Information Visualization, Computer Vision)", "Information and Society (Policy, Computer Science Education, Privacy and Security)"], "email": "kgajos@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/kgajos"},
{"website": "http://www.coxlab.org/", "bio": "David Cox is an Assistant Professor of Molecular and Cellular Biology and of Computer Science, and is a member of the Center for Brain Science at Harvard University. He completed his Ph.D. in the Department of Brain and Cognitive Sciences at MIT with a specialization in computational neuroscience. Prior to joining MCB/CBS, he was a Junior Fellow at the Rowland Institute at Harvard, a multidisciplinary institute focused on high-risk, high-reward scientific research at the boundaries of traditional fields. His laboratory seeks to understand the computational underpinnings of high-level visual processing through concerted efforts in both reverse- and forward-engineering. To this end, his group employs a wide range of experimental techniques (ranging from microelectrode recordings in living brains to visual psychophysics in humans) to probe natural systems, while at the same time actively developing practical computer vision systems based on what is learned about the brain.", "name": "David Cox", "title": "Assistant Professor of Molecular and Cellular Biology and of Computer Science", "phone": "", "address": "219.40 North West Building", "study_areas": ["Bioinspired Robotics and Computing", "Computational and Data Science (High Performance Computing, Connectomics, Large-scale Data Management)", "Computational Neuroscience", "Graphics, Vision and Interaction (Human-Computer Interaction, Computer Graphics, Scientific and Information Visualization, Computer Vision)"], "email": "davidcox@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/davidcox"},
{"website": "http://www.yiling.seas.harvard.edu", "bio": "Yiling Chen’s research lies at the intersection of computer science and economics, encompassing algorithms, complexity, mechanism design, game theory, optimization, multi-agent systems, and machine learning. She is interested in designing and analyzing social and organizational systems such as markets, information aggregation instruments, advertising mechanisms, and online communities, according to both computational and economic objectives. Chen received a Ph.D. in Information Sciences and Technology from Pennsylvania State University, University Park; a Master of Economics from Tsinghua University, Beijing, China; and a Bachelor of Economics from Renmin University, Beijing, China. Prior to Chen’s appointment at Harvard, she was a Postdoctoral Research Scientist at Yahoo! Research, and served as a Teaching/Research Assistant at various institutions, including Pennsylvania State University, Iowa State University, and Tsinghua University. Chen has served as the Tutorial Chair of the ACM Conference on Electronic Commerce (EC), 2008, and on the Program Committee for the International World Wide Web Conference (WWW), 2008, and the International Workshop on Internet and Network Economics (WINE), 2008. She has co-organized the 2nd and the 3rd Workshops on Prediction Markets, 2007-2008. She has also been a reviewer for Management Science, Information Systems Research, Decision Support Systems, Information Systems and e-Business Management, and various conferences. Chen’s awards include Outstanding Paper Award, ACM Conference on Electronic Commerce (EC), 2008; Honorable Mention, Decision Science Institute Doctoral Dissertation Competition, 2006; and eBRC Doctoral Support Award, eBusiness Research Center at Penn State University, 2004.", "name": "Yiling Chen", "title": "Gordan McKay Professor of Computer Science", "phone": "(617) 495-3298", "address": "233 Maxwell Dworkin", "study_areas": ["Economics and Computation", "Artificial Intelligence (Computational Linguistics, Machine Learning, Multi-agent Systems, Robotics)", "Economics and Computation"], "email": "yiling@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/yiling"},
{"website": "http://www.eecs.harvard.edu/~dbrooks/", "bio": "Professor Brooks' research focuses on the interaction between the architecture and software of computer systems and underlying hardware implementation issues. A major focus of his research has been to explore how lower-level design issues such as power dissipation and chip cooling can be modeled and addressed when making early-stage architectural decisions in computer systems. Exploring new architectures and software techniques that are aware of energy, temperature, and other lower-level design metrics is extremely important when designing modern computer systems. New emphasis on computer systems that optimize design metrics besides raw performance, such as battery life, form-factor, and cost-efficiency provide many new challenges for system designers. As the underlying technology continues to evolve, new design issues arise and existing challenges become more difficult. In many cases, architectures that are aware of these issues provide superior overall solutions. Professor Brooks' recent work has focused on linking architectural performance simulators with early stage power and temperature models. The methodology behind this work has been applied to academic research tools such as Wattch. Similar tools have been developed and used within industry, both for research and in early stage ower-analysis of product designs.", "name": "David M. Brooks", "title": "Haley Family Professor of Computer Science", "phone": "(617) 495-3989", "address": "141 Maxwell Dworkin", "study_areas": ["Architecture", "Computer Engineering and Architecture"], "email": "dbrooks@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/dbrooks"},
{"website": "http://www.boazbarak.org", "bio": "", "name": "Boaz Barak", "title": "Gordon McKay Professor of Computer Science", "phone": "(617) 496-0439", "address": "329 Maxwell Dworkin", "study_areas": ["Theory of Computation", "Information and Society (Policy, Computer Science Education, Privacy and Security)"], "email": "boaz@seas.harvard.edu", "profile_link": "https://www.seas.harvard.edu/directory/boaz"}]