[{"website": "http://www.cs.yale.edu/homes/spielman/", "bio": "<p>Daniel Spielman’s interests include the analysis of algorithms and heuristics, error-correcting codes, combinatorial scientific computing, spectral graph theory, and combinatorics.</p> <p>Awards Daniel Spielman has received are:</p> <p>1. The 2002 Information Theory Society Paper Award<br>\n2. Invitied speaker at the 2002 International Congress of<br>\nMathematicians.<br>\n3. Semi-plenary speaker at the 2003 International Symposium on<br>\nMath Programming.<br>\n4. 1995 ACM Doctoral Dissertation Award</p>", "name": "Daniel Spielman", "title": "Henry Ford II Professor of Computer Science and Mathematics ", "phone": "203-436-1264", "publications": ["“Smoothed Analysis of Algorithms: Why The Simplex Algorithm Usually Takes Polynomial Time,” Journal of the ACM, Vol 51 (3), pp. 385 - 463, 2004. With S.-H. Teng“Smoothed Analysis of Termination of Linear Programming Algorithms”, Mathematical Programming, Series B, Vol 97, pp. 375-404, 2003. With S.-H. Teng", "“Efficient Erasure Correcting Codes,” IEEE Transactions on Information Theory, 47(2), pp. 569-584, Feb. 2001. With M. G. Luby, M. Mitzenmacher and M. A. Shokrollahi.“Improved Low-Density Parity-Check Codes Using Irregular Graphs,” IEEE Transactions on Information Theory, 47(2), pp. 585-598, Feb. 2001. With M. G. Luby, M. Mitzenmacher and M. A. Shokrollahi.", "“Linear-Time Encodable and Decodable Error-Correcting Codes,” IEEE Transactions on Information Theory, 42(6), pp. 1723-1731, Nov. 1996.“Expander Codes,” IEEE Transactions on Information Theory, 42(6), pp. 1710-1722, Nov. 1996. With M. Sipser."], "address": "17 Hillhouse Avenue, New Haven, CT 06511-8937", "email": "daniel.spielman@yale.edu", "profile_link": "http://cpsc.yale.edu/people/daniel-spielman"},
{"website": "http://codex.cs.yale.edu/avi/", "bio": "<p>Avi Silberschatz is the Sidney J. Weinberg Professor of Computer Science at Yale University. Prior to joining Yale, he was the Vice President of the Information Sciences Research Center at Bell Laboratories, Murray Hill, New Jersey. Prior to that, he held a chaired professorship in the Department of Computer Sciences at the University of Texas at Austin. His research interests include database systems, operating systems, Bioscience database systems, storage system, network management, and distributed systems.</p> <p>Professor Silberschatz is a Fellow of ACM, a Fellow of IEEE, a Fellow of AAAS, and a member of the Connecticut Academy of Science and Engineering. He received the 2002 IEEE Taylor L. Booth Education Award, the 1998 ACM Karl V. Karlstrom Outstanding Educator Award, and the 1997 ACM SIGMOD Contribution Award. In recognition for his outstanding level of innovation and technical excellence, Silberschatz was awarded the Bell Laboratories President’s Award, in 1998 (QTM Project), 1999 (DataBlitz Project), and 2004 (NetInventory Project).</p> <p>Professor Silberschatz has graduated over a dozen Ph.D. students who now hold positions in academic institutions and industrial research laboratories. His writings have appeared in numerous ACM and IEEE publications and in other professional conferences and journals. He obtained over four dozen patents and over two dozen grants. He is a co-author of two well known textbooks – Operating System Concepts and Database System Concepts.</p> <p>Professor Silberschatz has written editorials dealing with technology and policy issues, which have appeared in various publications including The New York Times, Boston Globe, Hartford Courant, and Industry Standard, among others.</p>", "name": "Abraham Silberschatz", "title": "Sidney J. Weinberg Professor Computer Science", "phone": "203-432-4713", "publications": [], "address": "AKW 308, 51 Prospect St, New Haven, CT 06511-8937", "email": "abraham.silberschatz@yale.edu", "profile_link": "http://cpsc.yale.edu/people/abraham-silberschatz"},
{"website": "http://www.cs.yale.edu/homes/mahesh", "bio": "<p>Dr. Balakrishnan works in the union of distributed systems, networking and storage systems. He is particularly interested in new principles and abstractions that can simplify the construction of scalable, fault-tolerant software systems.</p>", "name": "Mahesh Balakrishnan", "title": "Associate Professor of Computer Science", "phone": "203-436-9450", "publications": ["Tango: Distributed Data Structures over a Shared Log. Mahesh Balakrishnan, Dahlia Malkhi, Ted Wobber, Ming Wu, Vijayan Prabhakaran, Michael Wei, John D. Davis, Sriram Rao, Tao Zou, Aviad Zuck. In SOSP 2013: The 24th ACM Symposium on Operating Systems Principles.", "Consistency-Based Service Level Agreements for Cloud Storage. Douglas Terry, Vijayan Prabhakaran, Rama Kotla, Mahesh Balakrishnan, Marcos K. Aguilera, Hussam Abu-Libdeh. In SOSP 2013: The 24th ACM Symposium on Operating Systems Principles.", "CORFU: A Shared Log Design for Flash Clusters. Mahesh Balakrishnan, Dahlia Malkhi, Vijayan Prabhakaran, Ted Wobber, Michael Wei, John D. Davis. In NSDI 2012: 9th Usenix Symposium on Networked Systems Design and Implementation, San Jose, CA, April 2012.", "Dr. Multicast: Rx for Data Center Communication Scalability. Ymir Vigfusson, Hussam Abu-Libdeh, Mahesh Balakrishnan, Ken Birman, Robert Burgess, Gregory Chockler, Haoyuan Li, Yoav Tock. In EuroSys 2010: 5th ACM European Conference on Computer Systems, Paris, France, April 2010.", "Extending SSD Lifetimes with Disk-Based Write Caches. Gokul Soundararajan, Vijayan Prabhakaran, Mahesh Balakrishnan, Ted Wobber. In FAST 2010: 8th USENIX Conference on File and Storage Technologies, San Jose, CA, February 2010.", "Ricochet: Lateral Error Correction for Time-Critical Multicast. Mahesh Balakrishnan, Ken Birman, Amar Phanishayee, Stefan Pleisch. In NSDI 2007: Fourth Usenix Symposium on Networked Systems Design and Implementation, Cambridge, MA, April 2007."], "address": "AKW 308A, 51 Prospect St, New Haven, CT 06511-8937", "email": "mahesh.balakrishnan@yale.edu", "profile_link": "http://cpsc.yale.edu/people/mahesh-balakrishnan"},
{"website": "http://www.cs.yale.edu/homes/aspnes/", "bio": "<p>James Aspnes is a Professor of Computer Science at Yale University. He holds an S.B. in Mathematics and an S.M. in Computer Science and Engineering from MIT, and a Ph.D. in Computer Science from Carnegie-Mellon University.</p> <p>James Aspnes’ research emphasizes the use of randomization to solve difficult core problems in the theory of distributed algorithms. His recent work has concentrated on tools for managing large-scale loosely structured systems as found in peer-to-peer networks and wireless sensor networks. These tools include novel distributed data structures supporting efficient range queries over large data sets scattered across many machines, new models of distributed computation that capture the limited resources of individual nodes in sensor systems, and mechanisms for providing security and fault-tolerance in large-scale systems with no restrictions on the arrival of new and possibly malevolent participants. His interests also include related problems in biology, economics, and learning theory.</p> <p>Professor Aspnes is a member of the editorial board for Algorithmica, has served as program committee chair for the PODC 2005 and DCOSS 2007 conferences, and has served on numerous conference program committees. He is a recipient of the Dylan Hixon Prize for Teaching Excellence in the Natural Sciences.</p>", "name": "James Aspnes", "title": "Professor of Computer Science; Director of Undergraduate Studies Computer Science, Spring 2016 ", "phone": "203-533-9862 ", "publications": [], "address": "AKW 401, 51 Prospect St, New Haven, CT 06511-8937", "email": "james.aspnes@yale.edu", "profile_link": "http://cpsc.yale.edu/people/james-aspnes"},
{"website": "", "bio": "<p>Professor Angluin is interested in machine learning and computational learning theory. Algorithmic modeling and analysis of learning tasks gives insight into the phenomena of learning, and suggests avenues for the creation of tools to help people learn, and for the design of “smarter” software and artificial agents that flexibly adapt their behavior. Professor Angluin’s thesis was among the first work to apply complexity theory to the field of inductive inference. Her work on learning from positive data reversed a previous dismissal of that topic, and established a flourishing line of research. Her work on learning with queries established the models and the foundational results for learning with membership queries. Recently, her work has focused on the areas of coping with errors in the answers to queries, map-learning by mobile robots, and fundamental questions in modeling the interaction of a teacher and a learner.</p> <p>Professor Angluin helped found the Computational Learning Theory conference, and has served on program committees for COLT and on the COLT Steering committee. She served as an area editor for Information and Computation from 1989-1992. She organized the Computer Science Department’s Perlis Symposium in April 2001: “From Statistics to Chat: Trends in Machine Learning.” She is a member of the Association for Computing Machinery and the Association for Women in Mathematics.</p>", "name": "Dana Angluin", "title": "Professor of Computer Science ", "phone": "203-432-1273", "publications": ["<p>“Queries revisited,” Proc. ALT 2001, 12-31,2001.</p>", "<p>“Robot navigation with distance queries,” with J. Westbrook and W. Zhu, SIAM Computing, 30:110-144, 2000.</p>", "<p>“Learning regular sets from queries and counterexamples,” Information and Computation, 75:87-106, 1989.</p>", "<p>“Finding patterns common to a set of strings,” Journal of Computer and System Sciences, 21:46-62, 1980.</p>"], "address": "AKW 414, 51 Prospect St, New Haven, CT 06511-8937", "email": "dana.angluin@yale.edu", "profile_link": "http://cpsc.yale.edu/people/dana-angluin"},
{"website": "http://cs-www.cs.yale.edu/homes/dna/", "bio": "<p>Daniel’s research interests are in database system architecture and<br>\nimplementation, cloud computing, and the Semantic Web. Before joining the<br>\nYale computer science faculty, he spent four years at the Massachusetts<br>\nInstitute of Technology where he received his Ph.D. Daniel has been a<br>\nrecipient of a Churchill Scholarship, an NSF Graduate Research Fellowship,<br>\nand a VLDB best paper award.</p>", "name": "Daniel Abadi", "title": "Associate Professor of Computer Science", "phone": "203-436-1265", "publications": ["<p>Scalable Semantic Web Data Management Using Vertical Partitioning. With<br>\nAdam Marcus, Samuel Madden, and Kate Hollenbach. In Proceedings of VLDB,<br>\n2007.</p>", "<p>C-Store: A Column-Oriented DBMS. With Michael Stonebraker, Adam Batkin,<br>\nXuedong Chen, Mitch Cherniack, Miguel Ferreira, Edmond Lau, Amerson Lin,<br>\nSamuel Madden, Elizabeth O’Neil, Patrick O’Neil, Alexander Rasin, Nga<br>\nTran, and Stan Zdonik. In Proceedings of VLDB, 2005.</p>", "<p>Column-Stores vs. Row-Stores: How Different Are They Really? With Samuel<br>\nMadden and Nabil Hachem. In Proceedings of SIGMOD, 2008.</p>", "<p>OLTP Through the Looking Glass, And What We Found There. With Stavros<br>\nHarizopoulos, Samuel Madden, and Michael Stonebraker. In Proceedings of<br>\nSIGMOD, 2008.</p>", "<p>Aurora: A New Model and Architecture for Data Stream Management. With Don<br>\nCarney, Ugur Cetintemel, Mitch Cherniack, Christian Convey, Sangdon Lee,<br>\nMichael Stonebraker, Nesime Tatbul, and Stan Zdonik. In VLDB Journal,<br>\n12(2), 2003.</p>"], "address": "AKW 201, 51 Prospect St, New Haven, CT 06511-8937", "email": "daniel.abadi@yale.edu", "profile_link": "http://cpsc.yale.edu/people/daniel-abadi"},
{"website": "http://www.cs.yale.edu/homes/vision/zucker/steve.html", "bio": "<p>Steven W. Zucker is the David and Lucile Packard Professor of Computer Science and Electrical Engineering at Yale University. Before moving to Yale in 1996, he was a Professor of Electrical Engineering at McGill University, Director of the Program in Artificial Intelligence and Robotics of the Canadian Institute for Advanced Research, and the Co-Director of the Computer Vision and Robotics Laboratory in the McGill Research Center for Intelligent Machines. He was elected a Fellow of the Canadian Institute for Advanced Research, a Fellow of the IEEE, and (by)Fellow of Churchill College, Cambridge.</p> <p>Professor Zucker obtained his education at Carnegie-Mellon University in Pittsburgh and at Drexel University in Philadelphia, and was a post-doctoral Research Fellow in Computer Science at the University of Maryland, College Park. He was Professor Invité at Institut National de Recherche en Informatique et en Automatique, Sophia-Antipolis, France, in 1989, a Visiting Professor of Computer Science at Tel Aviv University in January, 1993, and an SERC Fellow of the Isaac Newton Institute for Mathematical Sciences, University of Cambridge.</p> <p>Prof. Zucker has authored or co-authored more than 130 papers on computational vision, biological perception, artificial intelligence and robotics, and serves on the editorial boards of 8 journals.</p>", "name": "Steven Zucker", "title": "David and Lucile Packard Professor of Computer Science and Biomedical Engineering", "phone": "203-432-6434", "publications": [], "address": "AKW 407, 51 Prospect St, New Haven, CT 06511-8937", "email": "steven.zucker@yale.edu", "profile_link": "http://cpsc.yale.edu/people/steven-zucker"},
{"website": "", "bio": "<p>Yang Richard Yang is interested in computer networks, network security, distributed multimedia, and real-time systems. His latter research focuses are on end-to-end network congestion control and secure multicast. For congestion control, his research has spanned the life cycle of congestion control: design of new congestion control scheme, characterization of congestion control protocols, evaluation of the impacts of congestion control on emerging multimedia applications, and extension of unicast congestion control to multicast congestion control. For secure multicast, he is one of the main developers of keygem, a multicast group key management system that implements scalable and reliable rekeying.</p> <p>Yang is currently interested in the problems of network congestion control and group key management in the context of wireless and mobile networks as well as a network under denial of service attack. Given his past experience, he also follows closely the researches in artificial intelligence and database.</p>", "name": "Yang Yang", "title": "Professor of Computer Science and Electrical Engineering ", "phone": "203-432-6400", "publications": [], "address": "AKW 308A, 51 Prospect St, New Haven, CT 06511-8937", "email": "yang.r.yang@yale.edu", "profile_link": "http://cpsc.yale.edu/people/yang-yang"},
{"website": "http://www.cs.yale.edu/homes/shao-zhong/", "bio": "<p>Zhong Shao is a Professor of Computer Science at Yale University. His research interests include programming languages, compilers, formal methods, and operating systems. He earned his Ph.D. in Computer Science from Princeton University in 1994. During his early career, he was a key developer and author of many key compilation phases used in the Standard ML of New Jersey compiler, and also one of the first to build a type-based intermediate representation in a functional-language compiler. He designed and developed the first production-quality type-preserving compiler for the entire Standard ML 1997 language extended with higher-order modules and was the main architect of the FLINT certifying infrastructure.</p> <p>In recent years, he has been interested in developing and applying new language-based technologies to build certified system software (e.g., OS kernels and hypervisors). Certified software consists of a binary machine executable plus a rigorous machine-checkable proof that the software is free of bugs with respect to specific requirements. A certified OS kernel is a library-based kernel but with formal specifications and proofs about all of its abstraction layers and system libraries. Dr. Shao’s current research intends to attack the following three important questions: (1) Under a clean-slate approach, what are the right OS kernel structures that can offer the best support for resilience, extensibility, and security? (2) What are the best programming languages and developing environments for implementing such certified kernels? (3) What new formal methods we need to develop in order to support these new languages and make certified kernels both practical and scalable?</p>", "name": "Zhong Shao", "title": "Professor of Computer Science; Director of Undergraduate Studies Computer Science, Fall 2015 ", "phone": "203-432-6828", "publications": ["<p>“A Type System for Certified Binaries,” with V. Trifonov, B. Saha, and<br>\nN. Papaspyrou, ACM Transactions on Programming Languages and Systems<br>\n(TOPLAS), 27(1):1-45, January 2005.</p>", "<p>“Certified Self-Modifying Code,” with H. Cai, In Proc. 2007 ACM<br>\nSIGPLAN Conference on Programming Language Design and Implementation<br>\n(PLDI’07), June 2007.</p>", "<p>“Certifying Low-Level Programs with Hardware Interrupts and Preemptive<br>\nThreads,” with X. Feng, Y. Guo, and Y. Dong, In Proc. 2008 ACM<br>\nSIGPLAN Conference on Programming Language Design and Implementation<br>\n(PLDI’08), June 2008.</p>", "<p>“VeriML: Typed Computation of Logical Terms inside a Language with<br>\nEffects,” with A. Stampoulis, Proc 2010 ACM SIGPLAN International<br>\nConference on Functional Programming (ICFP’10), September 2010.</p>"], "address": "AKW 314, 51 Prospect St, New Haven, CT 06511-8937", "email": "zhong.shao@yale.edu", "profile_link": "http://cpsc.yale.edu/people/zhong-shao"},
{"website": "http://cs-www.cs.yale.edu/homes/scaz/", "bio": "<p>Brian Scassellati builds human-like robots to investigate models of human development. Many scientists have used computer simulations to model complex interactions of neural function, sensory processing, and motor control. Scassellati believes that robotics offers a new kind of tool in investigating human behavior. By building robotic systems based on models of human intelligence, the full complexity of real world environments can be used in evaluating these models. This research integrates work from artificial intelligence, machine vision, classical robotics, psychology, cognitive science, and human-machine interfaces.</p> <p>One of the major focuses of Scassellati’s work has been on how children develop social skills and an understanding of other people. Children gradually acquire many skills that allow them to learn from their interactions with adults, such as responding to pointing gestures, recognizing what someone else is looking at, and representing that other people have beliefs, goals, and desires that differ from those of the child. These abilities have often been called a “theory of mind” and are believed to be critical for language acquisition, for self-recognition, and in the development of imaginative play. Computational models of these skills are being developed, implemented, and tested on robotic platforms currently under construction. His previous robots have performed tasks such as imitating human arm gestures, distinguishing animate from inanimate stimuli based on self-propelled motion criteria, and learning to reach for visual targets.</p> <p>By building machines with social skills, we can not only begin to model human development but also construct machines with more natural interfaces. Machines that can engage in the same social dynamics that people use with each other will be easier to use, will be usable in a wider range of situations, and will not require the user to learn arbitrary commands.</p> <p>One of Scassellati’s current projects is to develop robotic systems that aid in the diagnosis of autism by autonomously classifying social interactions. He is also currently building a new robotic system that will help teach social skills to autistic children. Additional projects focus on how children build a representation of objects as entities that exist through space and time, how animate stimuli are distinguished from inanimate objects, how sensation and motor control coordination are achieved in simple arm movements, and how children and animals distinguish themselves from others.</p>", "name": "Brian Scassellati", "title": "Professor Computer Science and Mechanical Engineering and Materials Science", "phone": "203-432-1219", "publications": [], "address": "AKW 501, 51 Prospect St, New Haven, CT 06511-8937", "email": "brian.scassellati@yale.edu", "profile_link": "http://cpsc.yale.edu/people/brian-scassellati"},
{"website": "", "bio": "<p>Holly Rushmeier received the BS, MS and PhD degrees in Mechanical Engineering from Cornell University in 1977, 1986 and 1988 respectively. Between receiving the BS and returning to graduate school in 1983 she worked as an engineer at the Boeing Commercial Airplane Company and at Washington Natural Gas Company (now a part of Puget Sound Energy). In 1988 she joined the Mechanical Engineering faculty at Georgia Tech. While there she conducted sponsored research in the area of computer graphics image synthesis and taught classes heat transfer and numerical methods at both the undergraduate and graduate levels. At the end of 1991 Dr. Rushmeier joined the computing and mathematics staff of the National Institute of Standards and Technology, focusing on scientific data visualization.</p> <p>From 1996 to early 2004 Dr. Rushmeier was a research staff member at the IBM T.J. Watson Research Center. At IBM she worked on a variety of data visualization problems in applications ranging from engineering to finance. She also worked in the area of acquisition of data required for generating realistic computer graphics models, including a project to create a digital model of Michelangelo’s Florence Pieta, and the development of a scanning system to capture shape and appearance data for presenting Egyptian cultural artifacts on the World Wide Web.</p> <p>Dr. Rushmeier was Editor-in-Chief of ACM Transactions on Graphics from 1996-99. She has also served on the editorial board of IEEE Transactions on Visualization and Computer Graphics. She is currently on the editorial boards of IEEE Computer Graphics and Applications and Computer Graphics Forum. In 1996 she served as the papers chair for the ACM SIGGRAPH conference, in 1998 as the papers co-chair for the IEEE Visualization conference and in 2000 as the papers co-chair for the Eurographics Rendering Workshop. She has also served in numerous program committees including multiple years on the committees for SIGGRAPH, IEEE Visualization, Eurographics, Eurographics Rendering Workshop, and Graphics Interface.</p> <p>Dr. Rushmeier has lectured at many meetings and academic institutions, including three invited keynote presentations at international meetings (Eurographics Rendering Workshop 94, 3DIM 01 , Eurographics Conference 2001.) She has spoken at and/or organized many tutorials and panels at the SIGGRAPH and IEEE Visualization conferences. Dr. Rushmeier was appointed chair of the Computer Science Department, effective July 1, 2011.</p>", "name": "Holly Rushmeier", "title": "Professor of Computer Science ", "phone": "203-432-4091", "publications": ["F. Bernardini, I. Martin, J. Mittleman, H. Rushmeier, G. Taubin. “Building a Digital Model of Michelangelo’s Florentine Pieta’.” IEEE Computer Graphics & Applications, Jan. 2002, pp. 59-67.F. Bernardini and H. Rushmeier. “The 3D Model Acquisition Pipeline.” Computer Graphics Forum, Vol. 21, No. 2, 2002, pp. 149-172.", "G. Larson, H. Rushmeier and C. Piatko, “A Visibility Matching Tone Reproduction Operator for High Dynamic Range Scenes,” , IEEE Transactions on Visualization and Computer Graphics, October-December 1997, Vol. 3, No. 4, pp. 291-306.S. E. Chen, H. Rushmeier, G. Miller and D. Turner. “A Progressive Multipass Method for Global Illumination.” Computer Graphics (Proceedings of the ACM SIGGRAPH Conference) 25(4) (July 1991) 165-174."], "address": "AKW 207, 51 Prospect St, New Haven, CT 06511-8937", "email": "holly.rushmeier@yale.edu", "profile_link": "http://cpsc.yale.edu/people/holly-rushmeier"},
{"website": "", "bio": "<p>Vladimir Rokhlin’s research interests include fast deterministic and randomized algorithms of computational mathematics, numerical scattering theory, partial differential equations, integral equations, quadrature formulae, numerical harmonic analysis, numerical linear algebra, special functions, “fast” algorithms of numerical linear algebra.</p> <p>Rokhlin is a member of the National Academy of Sciences; Member of the National Academy of Engineering; recipient of the 2001 Leroy P. Steele Prize for a Seminal contribution to Research; recipient of the 2001 Rice University Distinguished Alumnus Award; recipient of the 2006 Institute of Electrical and Electronics Engineers (IEEE) Honorary Membership; 2009 SIAM Fellow; recipient of the 2011 Maxwell Prize from the ICIAM; recipient of the 2014 William Benter Prize.</p>", "name": "Vladimir Rokhlin", "title": "Arthur K. Watson Professor Computer Science and Mathematics; Director of Graduate Studies in Computer Science. Joined Yale Faculty 1985.", "phone": "203-432-1278", "publications": [], "address": "AKW 108, 51 Prospect St, New Haven, CT 06511-8937", "email": "vladimir.rokhlin@yale.edu", "profile_link": "http://cpsc.yale.edu/people/vladimir-rokhlin"},
{"website": "", "bio": "<p>Dr. Raykova’s research work is in the area of cryptography and applications to security. Her interests included secure computation which enables multiple parties to compute on their private data jointly without revealing their individual sensitive inputs to each other. Her work develops new efficient constructions for secure computation and implementations that aim to bring these techniques closer to practical use. Secure computation has numerous applications in almost any scenario that involves private information such as computation of medical data, running auctions, providing anonymous credentials, processing of financial records and many others. A special case of secure computation with wide applications on its own, which Dr. Raykova has worked on is secure search that allows mutually distrusting parties to share parts of their private data in a controlled manner.</p> <p>Another area of Dr. Raykova’s research is cryptographic obfuscation and its applications. The goal of a code obfuscation is to hide secrets in software by “obfuscating” the internal mechanisms of a program while preserving access to its functionality which enables the evaluation of the program on any input. Such capabilities would allow to implement proprietary algorithms, e.g., DNA analysis algorithms, in software that enables the use of the algorithm while protecting its inner workings. Hiding secrets into software may also be crucial for the effectiveness of some particular applications such as malware analysis tools that may need to include malware signatures. Dr. Raykova is an author of a breakthrough result that presented the first candidate construction for obfuscation of any program. Her work was featured in <em>Wired</em>, <em>Communications of ACM</em>, <em>IEEE Spectrum</em> and others. Obfuscation is also used for the construction of many new and very useful cryptographic functionalities such as a functional encryption, which is a special type of encryption that reveals only partial information about the encrypted messages, and protocols for efficient computation outsourcing, which allows a computationally powerful party such as the cloud to do work on behalf of a weak client without learning its private inputs. The work of Dr. Raykova has developed constructions for these cryptographic tools.</p> <p>Verifiable computation considers the setting where a party with limited storage and computation resources outsources its data to a powerful server such as a cloud service and later asks the server to run computation jobs on the outsourced data and report the results. In this setting the client wants to verify very efficiently the correctness of the results that the sever returns while doing much less work than the computation itself. Protocols for verifiable computation aim to achieve this goal. Dr. Raykova has developed one of the most efficient cryptographic approaches for verifiable computation which is used is almost all most recent implemented solutions for this task. Her work “Pinocchio: Nearly Practical Verifiable Computation” received the Best Paper Award at the IEEE Security and Privacy Conference in 2013 and was featured in the <em>MIT Technology Review</em>.</p> <p>Dr. Raykova is excited to work on new research problems in cryptography and directions that search for applications of cryptography tools to solve practical security questions.</p>", "name": "Mariana Raykova", "title": "Assistant Professor of Computer Science", "phone": "", "publications": [], "address": "51 Prospect St, New Haven, CT 06511-8937", "email": "mariana.raykova@yale.edu", "profile_link": "http://cpsc.yale.edu/people/mariana-raykova"},
{"website": "http://www.cs.yale.edu/homes/piskac/", "bio": "<p>Office Location: AKW 212<br>\nTelephone: 203.432.8001</p> <p>Ruzica Piskac is an assistant professor (tenure-track) at Yale, Computer Science Department. Her research interests span the areas of programming languages, software verification, automated reasoning, and code synthesis. A common thread in Ruzica’s research is improving software reliability and trustworthiness using formal techniques.</p> <p>Prior to joining Yale, Ruzica was an independent research group leader at the Max Planck Institute for Software Systems (MPI-SWS) in Germany (January 2012-August 2013). She was head of the Synthesis, Analysis and Automated Reasoning Group.</p> <p>Ruzica did her graduate studies at EPFL, Switzerland (2007-2011), where she worked under the supervision of Viktor Kuncak. She was awarded the Patrick Denantes Memorial Prize for her PhD dissertation. She holds a Master’s degree in Computer Science, obtained at the Max-Planck Institute for Computer Science in Saarbruecken, Germany, as well as a Master’s degree in mathematics from the University of Zagreb, Croatia.</p>", "name": "Ruzica Piskac", "title": "Assistant Professor of Computer Science ", "phone": "203-432-8001", "publications": [], "address": "AKW 212, 51 Prospect St, New Haven, CT 06511-8937", "email": "ruzica.piskac@yale.edu", "profile_link": "http://cpsc.yale.edu/people/ruzica-piskac"},
{"website": "", "bio": "<p>David Gelernter is professor of computer science at Yale, chief scientist at Mirror Worlds Technologies, contributing editor at the Weekly Standard and member of the National Council of the Arts. He’s the author of several books and many technical articles; also essays, art criticism and fiction. The “tuple spaces” introduced in Carriero and Gelernter’s Linda system (1983) are the basis of many computer-communication and distributed programming systems worldwide. “Mirror Worlds” (1991) “foresaw” the World Wide Web (Reuters, 3/20/01) and was “one of the inspirations for Java”; the “lifestreams” system (first implemented by Eric Freeman at Yale) is the basis for Mirror Worlds Technologies’ software. “Breaking out of the box” (NY Times magazine, ‘97) forecast and described the advent of less-ugly computers (Apple’s iMac arrived in ‘98). Gelernter’s essays are widely anthologized (for example in J. Brockman, ed., “The Next Fifty Years: new essays from 25 of the world’s leading scientists” (Vintage, 2002), R. Stolley, ed., “Life Magazine - Century of Change,” (Little Brown, 2001), and the ACM’s 50th Anniversary collection).</p> <p>He’s the author of “The Muse in the Machine” (1994, about poetry and AI), the novel “1939” (1995), “Machine Beauty” (1998, about aesthetics and technology) and other books; he’s published in Commentary, ArtNews, Washington Post and many others. Recent talks include the Bradley Lecture at the American Enterprise Institute, keynotes at Agenda 2003, Intl. Wireless World, PC Expo, and the 2002 Organick Lecture in Computer Science at Univ Utah.</p>", "name": "David Gelernter", "title": "Professor of Computer Science", "phone": "203-432-1240", "publications": [], "address": "AKW 107, 51 Prospect St, New Haven, CT 06511-8937", "email": "david.gelernter@yale.edu", "profile_link": "http://cpsc.yale.edu/people/david-gelernter"},
{"website": "http://www.cs.yale.edu/homes/dvm/", "bio": "<p>Drew McDermott has done work in several areas of artificial intelligence. One of his perennial interests is in planning algorithms, which calculate structures of actions for autonomous agents of various sorts. He did seminal work in the area of “hierarchical planning” in the 1970s. In the last decade, his focus has switched to regression-based techniques for classical planning, especially methods that heuristically search through situation space. He was instrumental in starting the biannual series of AI Planning Systems (AIPS) conferences. In 1998, he ran the first ever Planning Competition in conjunction with AIPS; it has now become a standard part of the ICAPS conference, the merger of AIPS and the European Conference on Planning (ECP).</p> <p>Another enduring interest of Prof. McDermott’s is in the area of knowledge representation (KR), which is the attempt to formalize what people know in a form usable by a computer. He wrote some influential papers on nonmonotonic logic and representation of temporal knowledge. However, in the mid-1980s he became convinced that the KR project, in its more ambitious formulations, was ill-defined. He published a paper titled “A Critique of Pure Reason” making this case. However, Prof. McDermott is now thinking about KR issues again, this time in conjunction with the problem of “metadata” on the world-wide web, which will tell automated agents what the content and capability of a web resource is. Hopefully solving this problem will not require tackling the original KR problem, which he still believes to be hopeless.</p> <p>Prof. McDermott is a Fellow of the American Association for Artificial Intelligence.</p>", "name": "Drew Mcdermott", "title": "Professor of Computer Science ", "phone": "203-432-1284", "publications": [], "address": "AKW 508, 51 Prospect St, New Haven, CT 06511-8937", "email": "drew.mcdermott@yale.edu", "profile_link": "http://cpsc.yale.edu/people/drew-mcdermott"},
{"website": "http://www.cs.yale.edu/homes/fischer/", "bio": "<p>Michael Fischer’s research interests include cryptographic protocols and security, theory of parallel and distributed systems, and discrete algorithms. Fischer is widely known for his work on the distributed consensus problem and for his “parallel prefix” algorithm that forms the basis of the “scan” operation fundamental to many parallel algorithms. Fischer directed one of the first Ph.D. dissertations on secure and verifiable e-voting (in the mid-1980’s) and has developed information-theoretically secure cryptosystems based on random card deals. Fischer is currently studying trust from an algorithmic point of view with a goal of allowing e-commerce systems to automatically learn and utilize necessary trust relationships.</p> <p>Fischer is chair of the International Scientific Advisory Board for the Max-Planck-Institute for Computer Science in Saarbrücken, Germany, and is Guest Professor of Wuhan University and member of Academic Committee of the State Key Laboratory on Software Engineering, Wuhan, China. He is a member of the editorial board of Acta Informatica. He is an ACM fellow and previously served as Editor-in-Chief of the Journal of the ACM. He has served on the Advisory Committee to the National Science Foundation and on the board of directors of the Computing Research Association, where he was a founding member of the CRA subcommittee on the Status of Women in Computer Science. He is active in the Yale Figure Skating Club, having served many terms on the executive committee as president and director. Fischer has taught at Carnegie Mellon University, the Massachusetts Institute of Technology, and the University of Washington.</p>", "name": "Michael Fischer", "title": "Professor of Computer Science ", "phone": "203-432-1270", "publications": [], "address": "AKW 408, 51 Prospect St, New Haven, CT 06511-8937", "email": "michael.fischer@yale.edu", "profile_link": "http://cpsc.yale.edu/people/michael-fischer"},
{"website": "http://cs-www.cs.yale.edu/homes/jf/home.html", "bio": "<p>Joan Feigenbaum is the Grace Murray Hopper Professor of Computer Science at Yale University. She received a B.A. in Mathematics from Harvard and a Ph.D. in Computer Science from Stanford. Between finishing her Ph.D. in 1986 and starting at Yale in 2000, she was with AT&amp;T, most recently in the Information Sciences Research Center of the AT&amp;T Shannon Laboratory in Florham Park, NJ. There she established a research group in the emerging area of algorithmics for massive data sets and served as manager of the group for two years.</p> <p>Professor Feigenbaum’s research interests include Internet algorithms, computational complexity, security and privacy, and digital copyright. She has a long-standing interest in fundamental problems in complexity theory that are motivated by cryptology and is co-inventor (with former colleagues Matt Blaze and Jack Lacy) of the security-research area of “trust management.” More recently, she has worked on basic algorithms for massive data sets, particularly those generated in network operations and business-to-consumer e-commerce. With collaborators Sampath Kannan, Martin Strauss, and Mahesh Viswanathan, Professor Feigenbaum has devised several highly influential algorithms for network-generated massive data, including a randomized algorithm for deciding whether two streams of router measurements are approximately equivalent and another for deciding whether a stream is close to having the “groupedness” property (a natural relaxation of the sortedness property). Within the area of e-commerce foundations, she has also worked on the interplay of incentives and computation. Using tools from microeconomics and game theory, computer scientists are now developing a theory of “incentive-compatible” distributed computation. In joint work with Arvind Krishnamurthy, Christos Papadimitriou, Rahul Sami, and Scott Shenker, Professor Feigenbaum has studied incentive-compatible protocols for multicast cost/sharing and interdomain routing.</p> <p>Professor Feigenbaum has an extensive record of distinguished service to the Computer Science community. From 1997 to 2002, she served as Editor-in-Chief of the Journal of Cryptology. She has also been an editorial-board member for the SIAM Journal on Computing, Program Chair for the Crypto 1991 and Complexity 1998 conferences, and Program Committee member for numerous conferences and workshops. Well known for her ability to establish and explicate research priorities, Professor Feigenbaum has given many high-profile, direction-setting, invited talks, including “Security and Privacy in the Information Economy” at the 1997 Grace Hopper Celebration of Women in Computing, “Games, Complexity, and Approximation Algorithms” at the 1998 International Congress of Mathematicians, and “Massive Graphs: Algorithms, Applications, and Open Problems” at the 1999 annual meetings of the American Mathematical Society and the Society for Industrial and Applied Mathematics.</p>", "name": "Joan Feigenbaum", "title": "Grace Murray Hopper Professor of Computer Science and Economics; Department Chair of Computer Science", "phone": "203-432-6432", "publications": [], "address": "AKW 512, 51 Prospect St, New Haven, CT 06511-8937", "email": "joan.feigenbaum@yale.edu", "profile_link": "http://cpsc.yale.edu/people/joan-feigenbaum"},
{"website": "http://sce.cs.yale.edu", "bio": "<p>Stanley Eisenstat’s major research interests include numerical linear and nonlinear algebra, direct and iterative methods for solving sparse linear systems, and parallel computing.</p> <p>He serves as an associate editor of the Journal of the ACM and is a member of the editorial board of the SIAM Journal on Matrix Analysis and Applications.</p>", "name": "Stanley Eisenstat", "title": "Professor of Computer Science", "phone": "203-432-1246", "publications": [], "address": "AKW 208, 51 Prospect St, New Haven, CT 06511-8937", "email": "stanley.eisenstat@yale.edu", "profile_link": "http://cpsc.yale.edu/people/stanley-eisenstat"},
{"website": "http://graphics.cs.yale.edu/julie/index.html", "bio": "<p>Julie Dorsey is a Professor of Computer Science at Yale University, where she teaches computer graphics. She came to Yale in 2002 from MIT, where she held tenured appointments in both the Department of Electrical Engineering and Computer Science (EECS) and the School of Architecture. She received undergraduate degrees in architecture and graduate degrees in computer science from Cornell University.</p> <p>With architecture as a driving application, she has studied a wide range of problems in computer graphics, including sketch-based interfaces for early conceptual design, acceleration methods for real-time rendering, and the creation of detailed photorealistic renderings. Her contributions also include algorithms for lighting and acoustical design and visualization. She is particularly well known for her research in modeling the appearance of materials – for example, she pioneered techniques to model the visual richness of irregular metal patinas and eroded stone. Her current research interests include photorealistic image synthesis, material and texture models, illustration techniques, and interactive visualization of complex scenes, with an application to urban environments.</p> <p>In addition to serving on numerous conference program committees, she is Editor-in-Chief of ACM Transactions on Graphics and an editorial-board member for Computers and Graphics and Foundations and Trends in Computer Graphics and Vision, and was Papers Chair for ACM SIGGRAPH 2006. She has received several professional awards, including MIT’s Edgerton Faculty Achievement Award, a National Science Foundation Career Award, and an Alfred P. Sloan Foundation Research Fellowship. She is a fellow of the Radcliffe Institute at Harvard (2010-11) and the Whitney Humanities Center at Yale (2010-12). Together with two of her colleagues, she recently helped establish the new <a href=\"http://cs-www.cs.yale.edu/c2/index.php\">Computing and the Arts </a>major at Yale.<br>\n </p>", "name": "Julie Dorsey", "title": "Professor of Computer Science", "phone": "203-432-4249", "publications": [], "address": "AKW 507, 51 Prospect St, New Haven, CT 06511-8937", "email": "julie.dorsey@yale.edu", "profile_link": "http://cpsc.yale.edu/people/julie-dorsey"}]